{
  "version": "1.0",
  "truncation": {
    "direction": "Right",
    "max_length": 128,
    "strategy": "LongestFirst",
    "stride": 0
  },
  "padding": {
    "strategy": {
      "Fixed": 128
    },
    "direction": "Right",
    "pad_to_multiple_of": null,
    "pad_id": 0,
    "pad_type_id": 0,
    "pad_token": "[PAD]"
  },
  "added_tokens": [
    {
      "id": 0,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[MASK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "[BOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "[EOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": "[UNK]",
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "[PAD]": 0,
      "[UNK]": 1,
      "[MASK]": 2,
      "[BOS]": 3,
      "[EOS]": 4,
      "#": 5,
      "(": 6,
      ")": 7,
      "+": 8,
      "-": 9,
      "/": 10,
      "1": 11,
      "2": 12,
      "3": 13,
      "4": 14,
      "5": 15,
      "6": 16,
      "7": 17,
      "8": 18,
      "=": 19,
      "@": 20,
      "B": 21,
      "C": 22,
      "E": 23,
      "F": 24,
      "H": 25,
      "I": 26,
      "N": 27,
      "O": 28,
      "P": 29,
      "S": 30,
      "[": 31,
      "\\": 32,
      "]": 33,
      "c": 34,
      "l": 35,
      "n": 36,
      "o": 37,
      "r": 38,
      "s": 39,
      "cc": 40,
      "OS": 41,
      "CC": 42,
      "BOS": 43,
      "EOS": 44,
      "c1": 45,
      "(=": 46,
      "c2": 47,
      "c1cc": 48,
      "](": 49,
      "@@": 50,
      "NC": 51,
      "c2cc": 52,
      "c3": 53,
      "CCC": 54,
      "c1ccc": 55,
      ")[": 56,
      "cc1": 57,
      "NH": 58,
      "+]": 59,
      "c1cccc": 60,
      "CO": 61,
      "1CC": 62,
      "c2cccc": 63,
      "n1": 64,
      "Cl": 65,
      "nc": 66,
      "C1": 67,
      "c3cc": 68,
      "2CC": 69,
      "OC": 70,
      "CC1": 71,
      "c2ccc": 72,
      "c2ccccc2": 73,
      "c1ccccc1": 74,
      ")(": 75,
      "(-": 76,
      "CN": 77,
      "([": 78,
      "cc2": 79,
      "n2": 80,
      "-]": 81,
      ")(=": 82,
      "1C": 83,
      "nH": 84,
      "C2": 85,
      "CC2": 86,
      "c1n": 87,
      "1CCC": 88,
      "c3cccc": 89,
      "-])": 90,
      "c1c": 91,
      "c2c": 92,
      "Cc1ccc": 93,
      "+](": 94,
      "NH2": 95,
      "CCO": 96,
      ")=": 97,
      "c3ccccc3": 98,
      "2C": 99,
      "CCN": 100,
      "c4": 101,
      "Cc1cc": 102,
      "N1CC": 103,
      "nn": 104,
      "COc1ccc": 105,
      "2CCC": 106,
      "s1": 107,
      "Br": 108,
      "CNC": 109,
      "CS": 110,
      "c3ccc": 111,
      "N2CC": 112,
      "c2n": 113,
      "ccc1": 114,
      "+](=": 115,
      "c1nc": 116,
      "COC": 117,
      "o1": 118,
      "cc3": 119,
      "3CC": 120,
      "c1C": 121,
      "nc2": 122,
      "cccc": 123,
      "NCC": 124,
      "C1CC": 125,
      "nc1": 126,
      "n3": 127,
      "c3c": 128,
      "+][": 129,
      "Nc1ccc": 130,
      "ccc": 131,
      "Cc1n": 132,
      "CC3": 133,
      "]([": 134,
      "NH3": 135,
      "s2": 136,
      "Cc1c": 137,
      "c2nc": 138,
      "Cn1": 139,
      "ccc2": 140,
      "Cc1cccc": 141,
      "sc": 142,
      "C2CC": 143,
      "N1CCC": 144,
      "C3": 145,
      "OCC": 146,
      "CCC1": 147,
      "1CCN": 148,
      "o2": 149,
      "COc1cc": 150,
      "(/": 151,
      "Cc1ccccc1": 152,
      "CCC2": 153,
      "@]": 154,
      "CCOC": 155,
      "@@]": 156,
      "oc": 157,
      "CCNC": 158,
      "O1": 159,
      "N1C": 160,
      "cc1C": 161,
      "CCn1": 162,
      "Nc1cc": 163,
      "+])": 164,
      "N1CCN": 165,
      "N2CCC": 166,
      "c2ccccc21": 167,
      ")/": 168,
      "c4cccc": 169,
      "N2C": 170,
      "Nc2ccc": 171,
      "N3": 172,
      "Nc1cccc": 173,
      "CCCC": 174,
      "SC": 175,
      "COc1cccc": 176,
      "Cc1nc": 177,
      "ncc": 178,
      "n2c": 179,
      "1CN": 180,
      "c2c1": 181,
      "N1": 182,
      "SCC": 183,
      "C2CC2": 184,
      "cc1F": 185,
      "nc3": 186,
      "COc1ccccc1": 187,
      "c4ccccc4": 188,
      "Cc2ccc": 189,
      "cn1": 190,
      "c12": 191,
      "cc1Cl": 192,
      "Cc2ccccc2": 193,
      "CCS": 194,
      "c1nnc": 195,
      "3C": 196,
      "CCCO": 197,
      "1CCCC": 198,
      "C1CC1": 199,
      "c1ccc2c": 200,
      "nn1": 201,
      "1CCCN": 202,
      "N2CCN": 203,
      "c1ncc": 204,
      "CCC3": 205,
      "c2C": 206,
      "NNC": 207,
      "c2ncc": 208,
      "Nc1ccccc1": 209,
      "CCOc1ccc": 210,
      "OCO": 211,
      "CCN1C": 212,
      "@](": 213,
      "cc1OC": 214,
      "no1": 215,
      "OCC2": 216,
      "OCC1": 217,
      "NS": 218,
      "N2": 219,
      "Nc2cc": 220,
      "nn2": 221,
      "O2": 222,
      "c3nc": 223,
      "Cn1c": 224,
      "CN1C": 225,
      "@@](": 226,
      "cc1NC": 227,
      "OCCO": 228,
      "=[": 229,
      "N3CC": 230,
      "c2nnc": 231,
      "2CCCC": 232,
      "CCc1ccc": 233,
      "cs1": 234,
      "CN2CC": 235,
      "NCc1ccc": 236,
      "n2cc": 237,
      "c4ccc": 238,
      "s3": 239,
      "C3CC": 240,
      "c3ccccc32": 241,
      "ncc2": 242,
      "NCCC": 243,
      "c23": 244,
      "Cn1cc": 245,
      "c1nn": 246,
      "c2cccs2": 247,
      "CCn1c": 248,
      "Nc2cccc": 249,
      "c1cccs1": 250,
      "ccc3": 251,
      "Nc2ccccc2": 252,
      "o3": 253,
      "Cc1nn": 254,
      "1CCO": 255,
      "c2ccccc12": 256,
      "Cc1": 257,
      "c2ccc3c": 258,
      "sc1": 259,
      "c3n": 260,
      "c1cc2": 261,
      "n1C": 262,
      "CCCC2": 263,
      "ncc1": 264,
      "1CC1": 265,
      "1CCCO1": 266,
      "n1c": 267,
      "1NC": 268,
      "c2cccnc2": 269,
      "+]([": 270,
      "Cc2c": 271,
      "c2ccco2": 272,
      "N2CCOCC2": 273,
      "1CCCC1": 274,
      "n2C": 275,
      "NN": 276,
      "c1ccco1": 277,
      "3CCC": 278,
      "CCO1": 279,
      "c2nn": 280,
      "c4c": 281,
      "cccc2": 282,
      "Cc3ccccc3": 283,
      "ccc21": 284,
      "C1CCN": 285,
      "N1CCOCC1": 286,
      "Nc1c": 287,
      "cc4": 288,
      "CCCNC": 289,
      "N2CCCC2": 290,
      "Cc2cc": 291,
      "+]=": 292,
      "c1nc2ccccc2": 293,
      "2CCCO2": 294,
      "1CCS": 295,
      "1CO": 296,
      "2CCN": 297,
      "C3CC3": 298,
      "1CCCCC1": 299,
      "cc2C": 300,
      "-])[": 301,
      "Cc2cccc": 302,
      "C4": 303,
      "NC1": 304,
      "Cc1noc": 305,
      "OC2": 306,
      "Oc1ccc": 307,
      "c2ccccc2C": 308,
      "c2ccccc2F": 309,
      "CCCC1": 310,
      "Cc1csc": 311,
      "c1ccccc1F": 312,
      "2CCCC2": 313,
      "CCCN": 314,
      "c2ccccc2c1": 315,
      "1O": 316,
      "NC2": 317,
      "c1ccccc1C": 318,
      "ccc1C": 319,
      "1c1ccc": 320,
      "c1ccccn1": 321,
      "ccc12": 322,
      "ccc1F": 323,
      "cn2": 324,
      "n4": 325,
      "c2nc3ccccc3": 326,
      "cccn2": 327,
      "c1OC": 328,
      "c1cn": 329,
      "nc12": 330,
      "CCOCC3": 331,
      "c1cccc2": 332,
      "c2cc3": 333,
      "no2": 334,
      "c1ccccc1Cl": 335,
      "c1ccncc1": 336,
      "CC4": 337,
      "2CCCN": 338,
      "nc1C": 339,
      "OCO2": 340,
      "sc2": 341,
      "c1ccccc1NC": 342,
      "n1cc": 343,
      "OCCO2": 344,
      "CN2C": 345,
      "c1cccnc1": 346,
      "n2nc": 347,
      "Cc3ccc": 348,
      "2CCCCC2": 349,
      "c2ccccc2Cl": 350,
      "c5": 351,
      "S1": 352,
      "c2ccccn2": 353,
      "c2cnn": 354,
      "C1C": 355,
      "nnc1": 356,
      "CCCC3": 357,
      "c1NC": 358,
      "sc1C": 359,
      "CCn1cc": 360,
      "nc4": 361,
      "Nc3ccc": 362,
      "2CC2": 363,
      "cc12": 364,
      "c2s": 365,
      "c2ccncc2": 366,
      "Nc1ccc2c": 367,
      "Nc1nc": 368,
      "(\\": 369,
      "cc2Cl": 370,
      "COCC": 371,
      "cc21": 372,
      "cc2F": 373,
      "c3ccccc23": 374,
      "nc2c1": 375,
      "on1": 376,
      "c2cn": 377,
      "c1csc": 378,
      "c1cnc": 379,
      "2C1": 380,
      "N1CCCC1": 381,
      "cs2": 382,
      "ccc1Cl": 383,
      "ccc1NC": 384,
      "c1noc": 385,
      "N3CCC": 386,
      "CN1CC": 387,
      "N4": 388,
      "ccc1OC": 389,
      "Cc1ncc": 390,
      "NCc2ccc": 391,
      ")([": 392,
      "c3cccs3": 393,
      "C1CCCC1": 394,
      "c1F": 395,
      "21": 396,
      "sc2c1": 397,
      "OCO3": 398,
      "CCc1nn": 399,
      "n3c": 400,
      "32": 401,
      "C1CCC": 402,
      "C1CCCCC1": 403,
      "CNS": 404,
      "ncc3": 405,
      "CN1CCN": 406,
      "2c": 407,
      "CCCO3": 408,
      "nn1C": 409,
      "@@](=": 410,
      "c2ccccc2C1": 411,
      "2CO": 412,
      "CCCCC": 413,
      "c3ccc4c": 414,
      "c1cnn": 415,
      "Cc1ccc2c": 416,
      "CCO2": 417,
      "c3c2": 418,
      "N3CCCC3": 419,
      "CCOc1cc": 420,
      "c1O": 421,
      "CSC": 422,
      "CCc1cc": 423,
      "cccc3": 424,
      "c2csc": 425,
      "c2noc": 426,
      "Cn2c": 427,
      "cc1S": 428,
      "c3ccccc3C": 429,
      "ccccc4": 430,
      "c3cccnc3": 431,
      "COc1ccc2c": 432,
      "Cc1nnc": 433,
      "c1Cl": 434,
      "N2CCCCC2": 435,
      "ccccc2": 436,
      "Oc2ccc": 437,
      "2CN": 438,
      "c1s": 439,
      "-])=": 440,
      "C2CCN": 441,
      "c3ncc": 442,
      "c3C": 443,
      "c3ccco3": 444,
      "@](=": 445,
      "Nc2nc": 446,
      "ncn2": 447,
      "N3CCOCC3": 448,
      "c3nc4": 449,
      "1S": 450,
      "COc2ccc": 451,
      "nc2ccccc21": 452,
      "n2cccn2": 453,
      "ccc2C": 454,
      "c1cc2c": 455,
      "no": 456,
      "3CCCC": 457,
      "cc2c1": 458,
      "n12": 459,
      "1c1ccccc1": 460,
      "Nc1n": 461,
      "cc1Br": 462,
      "C2C": 463,
      "/[": 464,
      "N3C": 465,
      "c3ccccn3": 466,
      "c1N": 467,
      "ccc1O": 468,
      "CSc1ccc": 469,
      "c1cncc": 470,
      "OCCO3": 471,
      "ccccc12": 472,
      "CCCCC2": 473,
      "2CCS": 474,
      "c3ccccc3c2": 475,
      "C2CCCC2": 476,
      "3CCCO3": 477,
      "c2sc": 478,
      "CCCCC1": 479,
      "nnn1": 480,
      "ccccc3": 481,
      "C2CCCCC2": 482,
      "cccn1": 483,
      "N3CCN": 484,
      "3C2": 485,
      "c3ccccc3F": 486,
      "CN2CCN": 487,
      "2CCO": 488,
      "cccn3": 489,
      "CSCC": 490,
      "c2cnc": 491,
      "CCn1nc": 492,
      "OC3": 493,
      "2O": 494,
      "NCC1": 495,
      "Cc1cnc": 496,
      "c3nnc": 497,
      "N1CCCCC1": 498,
      "CCN2C": 499
    },
    "merges": [
      [
        "c",
        "c"
      ],
      [
        "O",
        "S"
      ],
      [
        "C",
        "C"
      ],
      [
        "B",
        "OS"
      ],
      [
        "E",
        "OS"
      ],
      [
        "c",
        "1"
      ],
      [
        "(",
        "="
      ],
      [
        "c",
        "2"
      ],
      [
        "c1",
        "cc"
      ],
      [
        "]",
        "("
      ],
      [
        "@",
        "@"
      ],
      [
        "N",
        "C"
      ],
      [
        "c2",
        "cc"
      ],
      [
        "c",
        "3"
      ],
      [
        "CC",
        "C"
      ],
      [
        "c1cc",
        "c"
      ],
      [
        ")",
        "["
      ],
      [
        "cc",
        "1"
      ],
      [
        "N",
        "H"
      ],
      [
        "+",
        "]"
      ],
      [
        "c1cc",
        "cc"
      ],
      [
        "C",
        "O"
      ],
      [
        "1",
        "CC"
      ],
      [
        "c2cc",
        "cc"
      ],
      [
        "n",
        "1"
      ],
      [
        "C",
        "l"
      ],
      [
        "n",
        "c"
      ],
      [
        "C",
        "1"
      ],
      [
        "c3",
        "cc"
      ],
      [
        "2",
        "CC"
      ],
      [
        "O",
        "C"
      ],
      [
        "CC",
        "1"
      ],
      [
        "c2cc",
        "c"
      ],
      [
        "c2cccc",
        "c2"
      ],
      [
        "c1cccc",
        "c1"
      ],
      [
        ")",
        "("
      ],
      [
        "(",
        "-"
      ],
      [
        "C",
        "N"
      ],
      [
        "(",
        "["
      ],
      [
        "cc",
        "2"
      ],
      [
        "n",
        "2"
      ],
      [
        "-",
        "]"
      ],
      [
        ")",
        "(="
      ],
      [
        "1",
        "C"
      ],
      [
        "n",
        "H"
      ],
      [
        "C",
        "2"
      ],
      [
        "CC",
        "2"
      ],
      [
        "c1",
        "n"
      ],
      [
        "1",
        "CCC"
      ],
      [
        "c3cc",
        "cc"
      ],
      [
        "-]",
        ")"
      ],
      [
        "c1",
        "c"
      ],
      [
        "c2",
        "c"
      ],
      [
        "C",
        "c1ccc"
      ],
      [
        "+",
        "]("
      ],
      [
        "NH",
        "2"
      ],
      [
        "CC",
        "O"
      ],
      [
        ")",
        "="
      ],
      [
        "c3cccc",
        "c3"
      ],
      [
        "2",
        "C"
      ],
      [
        "CC",
        "N"
      ],
      [
        "c",
        "4"
      ],
      [
        "C",
        "c1cc"
      ],
      [
        "N",
        "1CC"
      ],
      [
        "n",
        "n"
      ],
      [
        "CO",
        "c1ccc"
      ],
      [
        "2",
        "CCC"
      ],
      [
        "s",
        "1"
      ],
      [
        "B",
        "r"
      ],
      [
        "C",
        "NC"
      ],
      [
        "C",
        "S"
      ],
      [
        "c3cc",
        "c"
      ],
      [
        "N",
        "2CC"
      ],
      [
        "c2",
        "n"
      ],
      [
        "cc",
        "c1"
      ],
      [
        "+]",
        "(="
      ],
      [
        "c1",
        "nc"
      ],
      [
        "CO",
        "C"
      ],
      [
        "o",
        "1"
      ],
      [
        "cc",
        "3"
      ],
      [
        "3",
        "CC"
      ],
      [
        "c1",
        "C"
      ],
      [
        "n",
        "c2"
      ],
      [
        "cc",
        "cc"
      ],
      [
        "N",
        "CC"
      ],
      [
        "C",
        "1CC"
      ],
      [
        "n",
        "c1"
      ],
      [
        "n",
        "3"
      ],
      [
        "c3",
        "c"
      ],
      [
        "+]",
        "["
      ],
      [
        "N",
        "c1ccc"
      ],
      [
        "cc",
        "c"
      ],
      [
        "C",
        "c1n"
      ],
      [
        "CC",
        "3"
      ],
      [
        "](",
        "["
      ],
      [
        "NH",
        "3"
      ],
      [
        "s",
        "2"
      ],
      [
        "C",
        "c1c"
      ],
      [
        "c2",
        "nc"
      ],
      [
        "C",
        "n1"
      ],
      [
        "cc",
        "c2"
      ],
      [
        "C",
        "c1cccc"
      ],
      [
        "s",
        "c"
      ],
      [
        "C",
        "2CC"
      ],
      [
        "N",
        "1CCC"
      ],
      [
        "C",
        "3"
      ],
      [
        "O",
        "CC"
      ],
      [
        "CCC",
        "1"
      ],
      [
        "1CC",
        "N"
      ],
      [
        "o",
        "2"
      ],
      [
        "CO",
        "c1cc"
      ],
      [
        "(",
        "/"
      ],
      [
        "C",
        "c1ccccc1"
      ],
      [
        "CCC",
        "2"
      ],
      [
        "@",
        "]"
      ],
      [
        "CC",
        "OC"
      ],
      [
        "@@",
        "]"
      ],
      [
        "o",
        "c"
      ],
      [
        "CC",
        "NC"
      ],
      [
        "O",
        "1"
      ],
      [
        "N",
        "1C"
      ],
      [
        "cc1",
        "C"
      ],
      [
        "CC",
        "n1"
      ],
      [
        "N",
        "c1cc"
      ],
      [
        "+]",
        ")"
      ],
      [
        "N1CC",
        "N"
      ],
      [
        "N",
        "2CCC"
      ],
      [
        "c2ccccc2",
        "1"
      ],
      [
        ")",
        "/"
      ],
      [
        "c4",
        "cccc"
      ],
      [
        "N",
        "2C"
      ],
      [
        "N",
        "c2ccc"
      ],
      [
        "N",
        "3"
      ],
      [
        "N",
        "c1cccc"
      ],
      [
        "CC",
        "CC"
      ],
      [
        "S",
        "C"
      ],
      [
        "CO",
        "c1cccc"
      ],
      [
        "C",
        "c1nc"
      ],
      [
        "n",
        "cc"
      ],
      [
        "n2",
        "c"
      ],
      [
        "1",
        "CN"
      ],
      [
        "c2",
        "c1"
      ],
      [
        "N",
        "1"
      ],
      [
        "S",
        "CC"
      ],
      [
        "C2CC",
        "2"
      ],
      [
        "cc1",
        "F"
      ],
      [
        "n",
        "c3"
      ],
      [
        "CO",
        "c1ccccc1"
      ],
      [
        "c4cccc",
        "c4"
      ],
      [
        "C",
        "c2ccc"
      ],
      [
        "c",
        "n1"
      ],
      [
        "c1",
        "2"
      ],
      [
        "cc1",
        "Cl"
      ],
      [
        "C",
        "c2ccccc2"
      ],
      [
        "CC",
        "S"
      ],
      [
        "c1n",
        "nc"
      ],
      [
        "3",
        "C"
      ],
      [
        "CCC",
        "O"
      ],
      [
        "1CC",
        "CC"
      ],
      [
        "C1CC",
        "1"
      ],
      [
        "c1cc",
        "c2c"
      ],
      [
        "n",
        "n1"
      ],
      [
        "1CCC",
        "N"
      ],
      [
        "N2CC",
        "N"
      ],
      [
        "c1n",
        "cc"
      ],
      [
        "CCC",
        "3"
      ],
      [
        "c2",
        "C"
      ],
      [
        "N",
        "NC"
      ],
      [
        "c2n",
        "cc"
      ],
      [
        "N",
        "c1ccccc1"
      ],
      [
        "CCO",
        "c1ccc"
      ],
      [
        "O",
        "CO"
      ],
      [
        "CCN",
        "1C"
      ],
      [
        "@",
        "]("
      ],
      [
        "cc1",
        "OC"
      ],
      [
        "n",
        "o1"
      ],
      [
        "O",
        "CC2"
      ],
      [
        "O",
        "CC1"
      ],
      [
        "N",
        "S"
      ],
      [
        "N",
        "2"
      ],
      [
        "N",
        "c2cc"
      ],
      [
        "n",
        "n2"
      ],
      [
        "O",
        "2"
      ],
      [
        "c3",
        "nc"
      ],
      [
        "Cn1",
        "c"
      ],
      [
        "CN",
        "1C"
      ],
      [
        "@@",
        "]("
      ],
      [
        "cc1",
        "NC"
      ],
      [
        "O",
        "CCO"
      ],
      [
        "=",
        "["
      ],
      [
        "N",
        "3CC"
      ],
      [
        "c2n",
        "nc"
      ],
      [
        "2CC",
        "CC"
      ],
      [
        "CC",
        "c1ccc"
      ],
      [
        "c",
        "s1"
      ],
      [
        "CN",
        "2CC"
      ],
      [
        "NC",
        "c1ccc"
      ],
      [
        "n2",
        "cc"
      ],
      [
        "c4",
        "ccc"
      ],
      [
        "s",
        "3"
      ],
      [
        "C",
        "3CC"
      ],
      [
        "c3ccccc3",
        "2"
      ],
      [
        "n",
        "cc2"
      ],
      [
        "N",
        "CCC"
      ],
      [
        "c2",
        "3"
      ],
      [
        "Cn1",
        "cc"
      ],
      [
        "c1n",
        "n"
      ],
      [
        "c2ccc",
        "s2"
      ],
      [
        "CCn1",
        "c"
      ],
      [
        "N",
        "c2cccc"
      ],
      [
        "c1ccc",
        "s1"
      ],
      [
        "cc",
        "c3"
      ],
      [
        "N",
        "c2ccccc2"
      ],
      [
        "o",
        "3"
      ],
      [
        "Cc1n",
        "n"
      ],
      [
        "1CC",
        "O"
      ],
      [
        "c2cccc",
        "c12"
      ],
      [
        "C",
        "c1"
      ],
      [
        "c2cc",
        "c3c"
      ],
      [
        "s",
        "c1"
      ],
      [
        "c3",
        "n"
      ],
      [
        "c1cc",
        "2"
      ],
      [
        "n1",
        "C"
      ],
      [
        "CC",
        "CC2"
      ],
      [
        "n",
        "cc1"
      ],
      [
        "1CC",
        "1"
      ],
      [
        "1CCC",
        "O1"
      ],
      [
        "n1",
        "c"
      ],
      [
        "1",
        "NC"
      ],
      [
        "c2ccc",
        "nc2"
      ],
      [
        "+](",
        "["
      ],
      [
        "C",
        "c2c"
      ],
      [
        "c2ccc",
        "o2"
      ],
      [
        "N2CC",
        "OCC2"
      ],
      [
        "1CC",
        "CC1"
      ],
      [
        "n2",
        "C"
      ],
      [
        "N",
        "N"
      ],
      [
        "c1ccc",
        "o1"
      ],
      [
        "3",
        "CCC"
      ],
      [
        "CCO",
        "1"
      ],
      [
        "c2",
        "nn"
      ],
      [
        "c4",
        "c"
      ],
      [
        "cc",
        "cc2"
      ],
      [
        "C",
        "c3ccccc3"
      ],
      [
        "ccc2",
        "1"
      ],
      [
        "C1CC",
        "N"
      ],
      [
        "N1CC",
        "OCC1"
      ],
      [
        "N",
        "c1c"
      ],
      [
        "cc",
        "4"
      ],
      [
        "CCC",
        "NC"
      ],
      [
        "N2CC",
        "CC2"
      ],
      [
        "C",
        "c2cc"
      ],
      [
        "+]",
        "="
      ],
      [
        "c1n",
        "c2ccccc2"
      ],
      [
        "2CCC",
        "O2"
      ],
      [
        "1CC",
        "S"
      ],
      [
        "1",
        "CO"
      ],
      [
        "2CC",
        "N"
      ],
      [
        "C3CC",
        "3"
      ],
      [
        "1CC",
        "CCC1"
      ],
      [
        "cc2",
        "C"
      ],
      [
        "-]",
        ")["
      ],
      [
        "C",
        "c2cccc"
      ],
      [
        "C",
        "4"
      ],
      [
        "NC",
        "1"
      ],
      [
        "Cc1n",
        "oc"
      ],
      [
        "OC",
        "2"
      ],
      [
        "O",
        "c1ccc"
      ],
      [
        "c2ccccc2",
        "C"
      ],
      [
        "c2ccccc2",
        "F"
      ],
      [
        "CC",
        "CC1"
      ],
      [
        "Cc1c",
        "sc"
      ],
      [
        "c1ccccc1",
        "F"
      ],
      [
        "2CC",
        "CC2"
      ],
      [
        "CCC",
        "N"
      ],
      [
        "c2ccccc2",
        "c1"
      ],
      [
        "1",
        "O"
      ],
      [
        "NC",
        "2"
      ],
      [
        "c1ccccc1",
        "C"
      ],
      [
        "ccc1",
        "C"
      ],
      [
        "1",
        "c1ccc"
      ],
      [
        "c1cccc",
        "n1"
      ],
      [
        "ccc1",
        "2"
      ],
      [
        "ccc1",
        "F"
      ],
      [
        "c",
        "n2"
      ],
      [
        "n",
        "4"
      ],
      [
        "c2n",
        "c3ccccc3"
      ],
      [
        "ccc",
        "n2"
      ],
      [
        "c1",
        "OC"
      ],
      [
        "c1c",
        "n"
      ],
      [
        "nc1",
        "2"
      ],
      [
        "CCO",
        "CC3"
      ],
      [
        "c1cccc",
        "2"
      ],
      [
        "c2cc",
        "3"
      ],
      [
        "n",
        "o2"
      ],
      [
        "c1ccccc1",
        "Cl"
      ],
      [
        "c1cc",
        "ncc1"
      ],
      [
        "CC",
        "4"
      ],
      [
        "2CCC",
        "N"
      ],
      [
        "n",
        "c1C"
      ],
      [
        "OCO",
        "2"
      ],
      [
        "s",
        "c2"
      ],
      [
        "c1ccccc1",
        "NC"
      ],
      [
        "n1",
        "cc"
      ],
      [
        "OCCO",
        "2"
      ],
      [
        "CN",
        "2C"
      ],
      [
        "c1ccc",
        "nc1"
      ],
      [
        "n2",
        "nc"
      ],
      [
        "C",
        "c3ccc"
      ],
      [
        "2CC",
        "CCC2"
      ],
      [
        "c2ccccc2",
        "Cl"
      ],
      [
        "c",
        "5"
      ],
      [
        "S",
        "1"
      ],
      [
        "c2cccc",
        "n2"
      ],
      [
        "c2c",
        "nn"
      ],
      [
        "C1",
        "C"
      ],
      [
        "nn",
        "c1"
      ],
      [
        "CC",
        "CC3"
      ],
      [
        "c1",
        "NC"
      ],
      [
        "s",
        "c1C"
      ],
      [
        "CCn1",
        "cc"
      ],
      [
        "nc",
        "4"
      ],
      [
        "N",
        "c3ccc"
      ],
      [
        "2CC",
        "2"
      ],
      [
        "cc1",
        "2"
      ],
      [
        "c2",
        "s"
      ],
      [
        "c2cc",
        "ncc2"
      ],
      [
        "Nc1cc",
        "c2c"
      ],
      [
        "N",
        "c1nc"
      ],
      [
        "(",
        "\\"
      ],
      [
        "cc2",
        "Cl"
      ],
      [
        "CO",
        "CC"
      ],
      [
        "cc2",
        "1"
      ],
      [
        "cc2",
        "F"
      ],
      [
        "c3cccc",
        "c23"
      ],
      [
        "nc2",
        "c1"
      ],
      [
        "o",
        "n1"
      ],
      [
        "c2c",
        "n"
      ],
      [
        "c1c",
        "sc"
      ],
      [
        "c1c",
        "nc"
      ],
      [
        "2",
        "C1"
      ],
      [
        "N1CC",
        "CC1"
      ],
      [
        "c",
        "s2"
      ],
      [
        "ccc1",
        "Cl"
      ],
      [
        "ccc1",
        "NC"
      ],
      [
        "c1n",
        "oc"
      ],
      [
        "N3",
        "CCC"
      ],
      [
        "CN",
        "1CC"
      ],
      [
        "N",
        "4"
      ],
      [
        "ccc1",
        "OC"
      ],
      [
        "Cc1n",
        "cc"
      ],
      [
        "NC",
        "c2ccc"
      ],
      [
        ")(",
        "["
      ],
      [
        "c3ccc",
        "s3"
      ],
      [
        "C1CC",
        "CC1"
      ],
      [
        "c1",
        "F"
      ],
      [
        "2",
        "1"
      ],
      [
        "s",
        "c2c1"
      ],
      [
        "OCO",
        "3"
      ],
      [
        "CC",
        "c1nn"
      ],
      [
        "n3",
        "c"
      ],
      [
        "3",
        "2"
      ],
      [
        "C1",
        "CCC"
      ],
      [
        "C1CC",
        "CCC1"
      ],
      [
        "CN",
        "S"
      ],
      [
        "n",
        "cc3"
      ],
      [
        "CN",
        "1CCN"
      ],
      [
        "2",
        "c"
      ],
      [
        "CCCO",
        "3"
      ],
      [
        "nn1",
        "C"
      ],
      [
        "@@]",
        "(="
      ],
      [
        "c2ccccc2",
        "C1"
      ],
      [
        "2",
        "CO"
      ],
      [
        "CC",
        "CCC"
      ],
      [
        "c3cc",
        "c4c"
      ],
      [
        "c1c",
        "nn"
      ],
      [
        "Cc1cc",
        "c2c"
      ],
      [
        "CCO",
        "2"
      ],
      [
        "c3",
        "c2"
      ],
      [
        "N3CC",
        "CC3"
      ],
      [
        "CCO",
        "c1cc"
      ],
      [
        "c1",
        "O"
      ],
      [
        "CS",
        "C"
      ],
      [
        "CC",
        "c1cc"
      ],
      [
        "cc",
        "cc3"
      ],
      [
        "c2c",
        "sc"
      ],
      [
        "c2n",
        "oc"
      ],
      [
        "C",
        "n2c"
      ],
      [
        "cc1",
        "S"
      ],
      [
        "c3ccccc3",
        "C"
      ],
      [
        "cccc",
        "c4"
      ],
      [
        "c3ccc",
        "nc3"
      ],
      [
        "COc1cc",
        "c2c"
      ],
      [
        "Cc1n",
        "nc"
      ],
      [
        "c1",
        "Cl"
      ],
      [
        "N2CC",
        "CCC2"
      ],
      [
        "cccc",
        "c2"
      ],
      [
        "O",
        "c2ccc"
      ],
      [
        "2",
        "CN"
      ],
      [
        "c1",
        "s"
      ],
      [
        "-])",
        "="
      ],
      [
        "C2CC",
        "N"
      ],
      [
        "c3",
        "ncc"
      ],
      [
        "c3",
        "C"
      ],
      [
        "c3ccc",
        "o3"
      ],
      [
        "@]",
        "(="
      ],
      [
        "N",
        "c2nc"
      ],
      [
        "nc",
        "n2"
      ],
      [
        "N3",
        "CCOCC3"
      ],
      [
        "c3nc",
        "4"
      ],
      [
        "1",
        "S"
      ],
      [
        "CO",
        "c2ccc"
      ],
      [
        "n",
        "c2ccccc21"
      ],
      [
        "n2",
        "cccn2"
      ],
      [
        "ccc2",
        "C"
      ],
      [
        "c1cc2",
        "c"
      ],
      [
        "n",
        "o"
      ],
      [
        "3CC",
        "CC"
      ],
      [
        "cc2",
        "c1"
      ],
      [
        "n1",
        "2"
      ],
      [
        "1",
        "c1ccccc1"
      ],
      [
        "N",
        "c1n"
      ],
      [
        "cc1",
        "Br"
      ],
      [
        "C2",
        "C"
      ],
      [
        "/",
        "["
      ],
      [
        "N3",
        "C"
      ],
      [
        "c3cccc",
        "n3"
      ],
      [
        "c1",
        "N"
      ],
      [
        "ccc1",
        "O"
      ],
      [
        "CS",
        "c1ccc"
      ],
      [
        "c1c",
        "ncc"
      ],
      [
        "OCCO",
        "3"
      ],
      [
        "cc",
        "ccc12"
      ],
      [
        "CC",
        "CCC2"
      ],
      [
        "2CC",
        "S"
      ],
      [
        "c3ccccc3",
        "c2"
      ],
      [
        "C2CC",
        "CC2"
      ],
      [
        "3",
        "CCCO3"
      ],
      [
        "c2",
        "sc"
      ],
      [
        "CC",
        "CCC1"
      ],
      [
        "nn",
        "n1"
      ],
      [
        "cccc",
        "c3"
      ],
      [
        "C2CC",
        "CCC2"
      ],
      [
        "ccc",
        "n1"
      ],
      [
        "N3",
        "CCN"
      ],
      [
        "3",
        "C2"
      ],
      [
        "c3ccccc3",
        "F"
      ],
      [
        "CN2CC",
        "N"
      ],
      [
        "2CC",
        "O"
      ],
      [
        "ccc",
        "n3"
      ],
      [
        "CS",
        "CC"
      ],
      [
        "c2c",
        "nc"
      ],
      [
        "CCn1",
        "nc"
      ],
      [
        "OC",
        "3"
      ],
      [
        "2",
        "O"
      ],
      [
        "N",
        "CC1"
      ],
      [
        "Cc1c",
        "nc"
      ],
      [
        "c3n",
        "nc"
      ],
      [
        "N1CC",
        "CCC1"
      ],
      [
        "CCN",
        "2C"
      ]
    ]
  }
}