{
  "version": "1.0",
  "truncation": {
    "direction": "Right",
    "max_length": 128,
    "strategy": "LongestFirst",
    "stride": 0
  },
  "padding": {
    "strategy": {
      "Fixed": 128
    },
    "direction": "Right",
    "pad_to_multiple_of": null,
    "pad_id": 0,
    "pad_type_id": 0,
    "pad_token": "[PAD]"
  },
  "added_tokens": [
    {
      "id": 0,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[MASK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "[BOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "[EOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": "[UNK]",
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "[PAD]": 0,
      "[UNK]": 1,
      "[MASK]": 2,
      "[BOS]": 3,
      "[EOS]": 4,
      "#": 5,
      "(": 6,
      ")": 7,
      "+": 8,
      "-": 9,
      "/": 10,
      "1": 11,
      "2": 12,
      "3": 13,
      "4": 14,
      "5": 15,
      "6": 16,
      "7": 17,
      "8": 18,
      "=": 19,
      "@": 20,
      "B": 21,
      "C": 22,
      "E": 23,
      "F": 24,
      "H": 25,
      "I": 26,
      "N": 27,
      "O": 28,
      "P": 29,
      "S": 30,
      "[": 31,
      "\\": 32,
      "]": 33,
      "c": 34,
      "l": 35,
      "n": 36,
      "o": 37,
      "r": 38,
      "s": 39,
      "cc": 40,
      "OS": 41,
      "CC": 42,
      "BOS": 43,
      "EOS": 44,
      "c1": 45,
      "(=": 46,
      "c2": 47,
      "c1cc": 48,
      "](": 49,
      "@@": 50,
      "NC": 51,
      "c2cc": 52,
      "c3": 53,
      "CCC": 54,
      "c1ccc": 55,
      ")[": 56,
      "cc1": 57,
      "NH": 58,
      "+]": 59,
      "c1cccc": 60,
      "CO": 61,
      "1CC": 62,
      "c2cccc": 63,
      "n1": 64,
      "Cl": 65,
      "nc": 66,
      "C1": 67,
      "c3cc": 68,
      "2CC": 69,
      "OC": 70,
      "CC1": 71,
      "c2ccc": 72,
      "c2ccccc2": 73,
      "c1ccccc1": 74,
      ")(": 75,
      "(-": 76,
      "CN": 77,
      "([": 78,
      "cc2": 79,
      "n2": 80,
      "-]": 81,
      ")(=": 82,
      "1C": 83,
      "nH": 84,
      "C2": 85,
      "CC2": 86,
      "c1n": 87,
      "1CCC": 88,
      "c3cccc": 89,
      "-])": 90,
      "c1c": 91,
      "c2c": 92,
      "Cc1ccc": 93,
      "+](": 94,
      "NH2": 95,
      "CCO": 96,
      ")=": 97,
      "c3ccccc3": 98,
      "2C": 99,
      "CCN": 100,
      "c4": 101,
      "Cc1cc": 102,
      "N1CC": 103,
      "nn": 104,
      "COc1ccc": 105,
      "2CCC": 106,
      "s1": 107,
      "Br": 108,
      "CNC": 109,
      "CS": 110,
      "c3ccc": 111,
      "N2CC": 112,
      "c2n": 113,
      "ccc1": 114,
      "+](=": 115,
      "c1nc": 116,
      "COC": 117,
      "o1": 118,
      "cc3": 119,
      "3CC": 120,
      "c1C": 121,
      "nc2": 122,
      "cccc": 123,
      "NCC": 124,
      "C1CC": 125,
      "nc1": 126,
      "n3": 127,
      "c3c": 128,
      "+][": 129,
      "Nc1ccc": 130,
      "ccc": 131,
      "Cc1n": 132,
      "CC3": 133,
      "]([": 134,
      "NH3": 135,
      "s2": 136,
      "Cc1c": 137,
      "c2nc": 138,
      "Cn1": 139,
      "ccc2": 140,
      "Cc1cccc": 141,
      "sc": 142,
      "C2CC": 143,
      "N1CCC": 144,
      "C3": 145,
      "OCC": 146,
      "CCC1": 147,
      "1CCN": 148,
      "o2": 149,
      "COc1cc": 150,
      "(/": 151,
      "Cc1ccccc1": 152,
      "CCC2": 153,
      "@]": 154,
      "CCOC": 155,
      "@@]": 156,
      "oc": 157,
      "CCNC": 158,
      "O1": 159,
      "N1C": 160,
      "cc1C": 161,
      "CCn1": 162,
      "Nc1cc": 163,
      "+])": 164,
      "N1CCN": 165,
      "N2CCC": 166,
      "c2ccccc21": 167,
      ")/": 168,
      "c4cccc": 169,
      "N2C": 170,
      "Nc2ccc": 171,
      "N3": 172,
      "Nc1cccc": 173,
      "CCCC": 174,
      "SC": 175,
      "COc1cccc": 176,
      "Cc1nc": 177,
      "ncc": 178,
      "n2c": 179,
      "1CN": 180,
      "c2c1": 181,
      "N1": 182,
      "SCC": 183,
      "C2CC2": 184,
      "cc1F": 185,
      "nc3": 186,
      "COc1ccccc1": 187,
      "c4ccccc4": 188,
      "Cc2ccc": 189,
      "cn1": 190,
      "c12": 191,
      "cc1Cl": 192,
      "Cc2ccccc2": 193,
      "CCS": 194,
      "c1nnc": 195,
      "3C": 196,
      "CCCO": 197,
      "1CCCC": 198,
      "C1CC1": 199,
      "c1ccc2c": 200,
      "nn1": 201,
      "1CCCN": 202,
      "N2CCN": 203,
      "c1ncc": 204,
      "CCC3": 205,
      "c2C": 206,
      "NNC": 207,
      "c2ncc": 208,
      "Nc1ccccc1": 209,
      "CCOc1ccc": 210,
      "OCO": 211,
      "CCN1C": 212,
      "@](": 213,
      "cc1OC": 214,
      "no1": 215,
      "OCC2": 216,
      "OCC1": 217,
      "NS": 218,
      "N2": 219,
      "Nc2cc": 220,
      "nn2": 221,
      "O2": 222,
      "c3nc": 223,
      "Cn1c": 224,
      "CN1C": 225,
      "@@](": 226,
      "cc1NC": 227,
      "OCCO": 228,
      "=[": 229,
      "N3CC": 230,
      "c2nnc": 231,
      "2CCCC": 232,
      "CCc1ccc": 233,
      "cs1": 234,
      "CN2CC": 235,
      "NCc1ccc": 236,
      "n2cc": 237,
      "c4ccc": 238,
      "s3": 239,
      "C3CC": 240,
      "c3ccccc32": 241,
      "ncc2": 242,
      "NCCC": 243,
      "c23": 244,
      "Cn1cc": 245,
      "c1nn": 246,
      "c2cccs2": 247,
      "CCn1c": 248,
      "Nc2cccc": 249,
      "c1cccs1": 250,
      "ccc3": 251,
      "Nc2ccccc2": 252,
      "o3": 253,
      "Cc1nn": 254,
      "1CCO": 255,
      "c2ccccc12": 256,
      "Cc1": 257,
      "c2ccc3c": 258,
      "sc1": 259,
      "c3n": 260,
      "c1cc2": 261,
      "n1C": 262,
      "CCCC2": 263,
      "ncc1": 264,
      "1CC1": 265,
      "1CCCO1": 266,
      "n1c": 267,
      "1NC": 268,
      "c2cccnc2": 269,
      "+]([": 270,
      "Cc2c": 271,
      "c2ccco2": 272,
      "N2CCOCC2": 273,
      "1CCCC1": 274,
      "n2C": 275,
      "NN": 276,
      "c1ccco1": 277,
      "3CCC": 278,
      "CCO1": 279,
      "c2nn": 280,
      "c4c": 281,
      "cccc2": 282,
      "Cc3ccccc3": 283,
      "ccc21": 284,
      "C1CCN": 285,
      "N1CCOCC1": 286,
      "Nc1c": 287,
      "cc4": 288,
      "CCCNC": 289,
      "N2CCCC2": 290,
      "Cc2cc": 291,
      "+]=": 292,
      "c1nc2ccccc2": 293,
      "2CCCO2": 294,
      "1CCS": 295,
      "1CO": 296,
      "2CCN": 297,
      "C3CC3": 298,
      "1CCCCC1": 299,
      "cc2C": 300,
      "-])[": 301,
      "Cc2cccc": 302,
      "C4": 303,
      "NC1": 304,
      "Cc1noc": 305,
      "OC2": 306,
      "Oc1ccc": 307,
      "c2ccccc2C": 308,
      "c2ccccc2F": 309,
      "CCCC1": 310,
      "Cc1csc": 311,
      "c1ccccc1F": 312,
      "2CCCC2": 313,
      "CCCN": 314,
      "c2ccccc2c1": 315,
      "1O": 316,
      "NC2": 317,
      "c1ccccc1C": 318,
      "ccc1C": 319,
      "1c1ccc": 320,
      "c1ccccn1": 321,
      "ccc12": 322,
      "ccc1F": 323,
      "cn2": 324,
      "n4": 325,
      "c2nc3ccccc3": 326,
      "cccn2": 327,
      "c1OC": 328,
      "c1cn": 329,
      "nc12": 330,
      "CCOCC3": 331,
      "c1cccc2": 332,
      "c2cc3": 333,
      "no2": 334,
      "c1ccccc1Cl": 335,
      "c1ccncc1": 336,
      "CC4": 337,
      "2CCCN": 338,
      "nc1C": 339,
      "OCO2": 340,
      "sc2": 341,
      "c1ccccc1NC": 342,
      "n1cc": 343,
      "OCCO2": 344,
      "CN2C": 345,
      "c1cccnc1": 346,
      "n2nc": 347,
      "Cc3ccc": 348,
      "2CCCCC2": 349,
      "c2ccccc2Cl": 350,
      "c5": 351,
      "S1": 352,
      "c2ccccn2": 353,
      "c2cnn": 354,
      "C1C": 355,
      "nnc1": 356,
      "CCCC3": 357,
      "c1NC": 358,
      "sc1C": 359,
      "CCn1cc": 360,
      "nc4": 361,
      "Nc3ccc": 362,
      "2CC2": 363,
      "cc12": 364,
      "c2s": 365,
      "c2ccncc2": 366,
      "Nc1ccc2c": 367,
      "Nc1nc": 368,
      "(\\": 369,
      "cc2Cl": 370,
      "COCC": 371,
      "cc21": 372,
      "cc2F": 373,
      "c3ccccc23": 374,
      "nc2c1": 375,
      "on1": 376,
      "c2cn": 377,
      "c1csc": 378,
      "c1cnc": 379,
      "2C1": 380,
      "N1CCCC1": 381,
      "cs2": 382,
      "ccc1Cl": 383,
      "ccc1NC": 384,
      "c1noc": 385,
      "N3CCC": 386,
      "CN1CC": 387,
      "N4": 388,
      "ccc1OC": 389,
      "Cc1ncc": 390,
      "NCc2ccc": 391,
      ")([": 392,
      "c3cccs3": 393,
      "C1CCCC1": 394,
      "c1F": 395,
      "21": 396,
      "sc2c1": 397,
      "OCO3": 398,
      "CCc1nn": 399,
      "n3c": 400,
      "32": 401,
      "C1CCC": 402,
      "C1CCCCC1": 403,
      "CNS": 404,
      "ncc3": 405,
      "CN1CCN": 406,
      "2c": 407,
      "CCCO3": 408,
      "nn1C": 409,
      "@@](=": 410,
      "c2ccccc2C1": 411,
      "2CO": 412,
      "CCCCC": 413,
      "c3ccc4c": 414,
      "c1cnn": 415,
      "Cc1ccc2c": 416,
      "CCO2": 417,
      "c3c2": 418,
      "N3CCCC3": 419,
      "CCOc1cc": 420,
      "c1O": 421,
      "CSC": 422,
      "CCc1cc": 423,
      "cccc3": 424,
      "c2csc": 425,
      "c2noc": 426,
      "Cn2c": 427,
      "cc1S": 428,
      "c3ccccc3C": 429,
      "ccccc4": 430,
      "c3cccnc3": 431,
      "COc1ccc2c": 432,
      "Cc1nnc": 433,
      "c1Cl": 434,
      "N2CCCCC2": 435,
      "ccccc2": 436,
      "Oc2ccc": 437,
      "2CN": 438,
      "c1s": 439,
      "-])=": 440,
      "C2CCN": 441,
      "c3ncc": 442,
      "c3C": 443,
      "c3ccco3": 444,
      "@](=": 445,
      "Nc2nc": 446,
      "ncn2": 447,
      "N3CCOCC3": 448,
      "c3nc4": 449,
      "1S": 450,
      "COc2ccc": 451,
      "nc2ccccc21": 452,
      "n2cccn2": 453,
      "ccc2C": 454,
      "c1cc2c": 455,
      "no": 456,
      "3CCCC": 457,
      "cc2c1": 458,
      "n12": 459,
      "1c1ccccc1": 460,
      "Nc1n": 461,
      "cc1Br": 462,
      "C2C": 463,
      "/[": 464,
      "N3C": 465,
      "c3ccccn3": 466,
      "c1N": 467,
      "ccc1O": 468,
      "CSc1ccc": 469,
      "c1cncc": 470,
      "OCCO3": 471,
      "ccccc12": 472,
      "CCCCC2": 473,
      "2CCS": 474,
      "c3ccccc3c2": 475,
      "C2CCCC2": 476,
      "3CCCO3": 477,
      "c2sc": 478,
      "CCCCC1": 479,
      "nnn1": 480,
      "ccccc3": 481,
      "C2CCCCC2": 482,
      "cccn1": 483,
      "N3CCN": 484,
      "3C2": 485,
      "c3ccccc3F": 486,
      "CN2CCN": 487,
      "2CCO": 488,
      "cccn3": 489,
      "CSCC": 490,
      "c2cnc": 491,
      "CCn1nc": 492,
      "OC3": 493,
      "2O": 494,
      "NCC1": 495,
      "Cc1cnc": 496,
      "c3nnc": 497,
      "N1CCCCC1": 498,
      "CCN2C": 499,
      "CCc1nc": 500,
      "N1CCO": 501,
      "n1CC": 502,
      "nn3": 503,
      "Cn1nc": 504,
      "S2": 505,
      "n3cc": 506,
      "c1nccs1": 507,
      "c2cccc3": 508,
      "CCOc1ccccc1": 509,
      "oc1": 510,
      "CCc1ccccc1": 511,
      "ncn1": 512,
      "c4cc": 513,
      "CSc1nnc": 514,
      "cc1O": 515,
      "CCc1cccc": 516,
      "Cc1cccs1": 517,
      "NCc1cc": 518,
      "12": 519,
      "nc2C": 520,
      "1CCCN1C": 521,
      "3CCCC3": 522,
      "n3C": 523,
      "CCOc1cccc": 524,
      "Nc2c": 525,
      "2CCCN2C": 526,
      "sc3": 527,
      "+])[": 528,
      "CCCN1C": 529,
      "Oc1cccc": 530,
      "1CS": 531,
      "1Cc2ccccc2": 532,
      "c1ccn": 533,
      "NCc1ccccc1": 534,
      "NCCN": 535,
      "c3ccncc3": 536,
      "Nc1nnc": 537,
      "nn2C": 538,
      "CCCS": 539,
      "CC1CC": 540,
      "NC1CC1": 541,
      "c2nc3c": 542,
      "cccc1Cl": 543,
      "c1sc": 544,
      "c1ccsc1": 545,
      "N1CCCC": 546,
      "CCCC4": 547,
      "1c1cccc": 548,
      "CCl": 549,
      "ccn1": 550,
      "OC1": 551,
      "cc2C1": 552,
      "Cc1cc2": 553,
      "nc2n1": 554,
      "c2cc3c": 555,
      "1OCC": 556,
      "on2": 557,
      "Nc2ccc3c": 558,
      "oc2": 559,
      "1CCCCN1C": 560,
      "ccc2F": 561,
      "nc2c": 562,
      "oc2c1": 563,
      "NC2CC2": 564,
      "nnc": 565,
      "CCc1n": 566,
      "NC3": 567,
      "cccc1F": 568,
      "CSc1n": 569,
      "1CCOC1": 570,
      "2NC": 571,
      "nc21": 572,
      "4CC": 573,
      "c2ccsc2": 574,
      "CC1CCN": 575,
      "Nc1ccccc1C": 576,
      "c2ncccn2": 577,
      "c2nccs2": 578,
      "Cc1ccsc1": 579,
      "c3ccccc3C2": 580,
      "c2n1": 581,
      "2CS": 582,
      "Nc3ccccc3": 583,
      "1N": 584,
      "Cn2cc": 585,
      "CCNS": 586,
      "Cn2": 587,
      "CCCO2": 588,
      "Cc1ccco1": 589,
      "cccc1": 590,
      "3CC3": 591,
      "4C": 592,
      "NCCNC": 593,
      "Cc1ccccc1C": 594,
      "c2cncc": 595,
      "3CCCCC3": 596,
      "Nc3cccc": 597,
      "NCc1cccc": 598,
      "OCO4": 599,
      "Cc2nc": 600,
      "nc2cc": 601,
      "Cc1cnn": 602,
      "CCN1CC": 603,
      "CCc1c": 604,
      "c1cc2ccccc2": 605,
      "c32": 606,
      "c1o": 607,
      "c2ccccc2n1": 608,
      "nc23": 609,
      "CCOCC1": 610,
      "Cc1cccc2": 611,
      "N3CCCCC3": 612,
      "CSc2nnc": 613,
      "2c2ccc": 614,
      "Cc3c": 615,
      "1CCOC2": 616,
      "CCCn1c": 617,
      ")=[": 618,
      "N2CCCC": 619,
      "ccc2Cl": 620,
      "Nc2ccccc2C": 621,
      "c4ccccc43": 622,
      "OCCC": 623,
      "c3nc4ccccc4": 624,
      "Oc1ccccc1": 625,
      "c2nc3ccccc3s2": 626,
      "2N": 627,
      "cc32": 628,
      "ccccc23": 629,
      "c2oc": 630,
      "Cc1cccnc1": 631,
      "c1nc2ccccc2s1": 632,
      "NC1CCCCC1": 633,
      "c21": 634,
      "ccc1Br": 635,
      "Sc1nnc": 636,
      "Oc2ccccc2": 637,
      "1OC": 638,
      "c3ccccc3Cl": 639,
      "c3s": 640,
      "SC1": 641,
      "NCc2cc": 642,
      "c2o": 643,
      "CO2": 644,
      "COCCN": 645,
      "Nc3cc": 646,
      "ccccc5": 647,
      "COc1c": 648,
      "C1N": 649,
      "COc1ccccc1C": 650,
      "COc1ccccc1NC": 651,
      "Cc1o": 652,
      "CSc1nc": 653,
      "nc2s": 654,
      "n2cncn2": 655,
      "c2ccccc2O1": 656,
      "n2cnn": 657,
      "N2CCO": 658,
      "ccc32": 659,
      "c34": 660,
      "Cc1ccccc1NC": 661,
      "c3nn": 662,
      "c2c1C": 663,
      "no3": 664,
      "1CCCCC": 665,
      "ccc2c1": 666,
      "3CCN": 667,
      "n1nc": 668,
      "oc1C": 669,
      "Cc1ccccn1": 670,
      "CCc2ccccc2": 671,
      "n3nc": 672,
      "Fc1ccc": 673,
      "O3": 674,
      "c1ccc2ccccc2c1": 675,
      "n2CC": 676,
      "CCCCNC": 677,
      "c2Cl": 678,
      "CCCc1cc": 679,
      "c1CC": 680,
      "Cc1nc2ccccc2": 681,
      "Cc2ccco2": 682,
      "CN1CCC": 683,
      "CN2CCC": 684,
      "2CCOC2": 685,
      "c1cccc2ccccc12": 686,
      "FC": 687,
      "n2ccnc2": 688,
      "CCOCC": 689,
      "CCC4": 690,
      "2C3": 691,
      "c1ccnc": 692,
      "2c2ccccc2": 693,
      "(\\[": 694,
      "Cc3cccc": 695,
      "cc3C": 696,
      "Cc3cc": 697,
      "n2n1": 698,
      "cc1N": 699,
      "cccc2Cl": 700,
      "cn": 701,
      "NCc2ccccc2": 702,
      "1CCc2c": 703,
      "n1cccn1": 704,
      "2CCOCC2": 705,
      "NCC2": 706,
      "cn3": 707,
      "CCCCN": 708,
      "NC1CC": 709,
      "COCCNC": 710,
      "Cc4ccccc4": 711,
      "CCCOc1ccc": 712,
      "COc1cccc2": 713,
      "NC1CCCC1": 714,
      "2CC3CC": 715,
      "cc23": 716,
      "C4CC4": 717,
      "CN2CCOCC2": 718,
      "CCc1noc": 719,
      "c1nc2c": 720,
      "c1CCC": 721,
      "c3cnn": 722,
      "cnn1C": 723,
      "sc2nc": 724,
      "Cc1cc2c": 725,
      "ccc4": 726,
      "c2C1": 727,
      "nc2ccccc12": 728,
      "1COc2ccccc2O1": 729,
      "CCCO1": 730,
      "n3cccn3": 731,
      "Cc1cn": 732,
      "cccc2F": 733,
      "NCc2cccc": 734,
      "Cc1ccc2nc": 735,
      "N2CCCCCC2": 736,
      "CCCn1cc": 737,
      "c1ccccc1OC": 738,
      "n23": 739,
      "SCC1": 740,
      "cc1CNC": 741,
      "Nc1cccc2": 742,
      "CN1CCO": 743,
      "Cc2cccs2": 744,
      "n2cccc2": 745,
      "NCc1ccco1": 746,
      "Nc2nnc": 747,
      "c1ncccc1C": 748,
      "CCCCC4": 749,
      "s4": 750,
      "CCN1CCN": 751,
      "c3ncccn3": 752,
      "cnn1": 753,
      "1C2": 754,
      "c2F": 755,
      "CCCCC3": 756,
      "1CCOCC1": 757,
      "Nc1cccnc1": 758,
      "N1CCC2": 759,
      "n2nn": 760,
      "Cc2csc": 761,
      "c5ccccc5": 762,
      "Cc1ccnc": 763,
      "cc2s1": 764,
      "C1NC": 765,
      "COc1cc2c": 766,
      "c2ccccn12": 767,
      "3CCOCC3": 768,
      "n1nn": 769,
      "C1CCOCC1": 770,
      "ncn3": 771,
      "c3cc4": 772,
      "n2c1": 773,
      "ccc23": 774,
      "CCc1nnc": 775,
      "c2N": 776,
      "CCN1": 777,
      "C1CCC1": 778,
      "CCOCC4": 779,
      "c1ccccc1Br": 780,
      "nn3C": 781,
      "nn12": 782,
      "nc3ccccc32": 783,
      "CC1CCC": 784,
      "Nc1cnn": 785,
      "nc3c": 786,
      "n1C1CC1": 787,
      "c4ccccc34": 788,
      "1Cc1ccccc1": 789,
      "NCCO": 790,
      "CNc1ccc": 791,
      "N1CCc2cc": 792,
      "nc3c2": 793,
      "cccc1NC": 794,
      "1CCCCCC1": 795,
      "c2sccc2": 796,
      "CC1CC1": 797,
      "OCCCO2": 798,
      "C1CN": 799,
      "CCOCC2": 800,
      "c2nnnn2": 801,
      "CNc2ccc": 802,
      "c2ncn": 803,
      "C3CCCCC3": 804,
      "c2cccnc21": 805,
      "CN1": 806,
      "N1CCc2ccccc21": 807,
      "Cc1oc": 808,
      "Oc2cc": 809,
      "1CCCCO1": 810,
      "Cn1ccc": 811,
      "Cc1ccccc1F": 812,
      "c2cc3ccccc3": 813,
      "N1c1ccc": 814,
      "o4": 815,
      "Oc2cccc": 816,
      "cc1OCC": 817,
      "C3CCCC3": 818,
      "c1ccc2": 819,
      "ccc1N": 820,
      "NC1CCN": 821,
      "c2nc3ccc": 822,
      "NCCc1ccc": 823,
      "NC2CCCCC2": 824,
      "+])(": 825,
      "c1ncnc": 826,
      "Cn2nc": 827,
      "c2ccccc2OC": 828,
      "Cc1ccn": 829,
      "N1CCCN": 830,
      "Cc2ccccn2": 831,
      "12CC": 832,
      "CCO3": 833,
      "SCC2": 834,
      "cccc1C": 835,
      "1CCCc2ccccc21": 836,
      "Cc2cccnc2": 837,
      "Nc3nc": 838,
      "c1CNC": 839,
      "c2nccc": 840,
      "N1CCOC": 841,
      "nc2c1c": 842,
      "SC2": 843,
      "c3ccccc3n2": 844,
      "OCCO4": 845,
      "cc3F": 846,
      "Cn1ncc2": 847,
      "Cc1sc": 848,
      "OCc2ccccc2": 849,
      "Nc1nc2c": 850,
      "23": 851,
      "OCCN": 852,
      "c2ccccc2N": 853,
      "N1CCCCCC1": 854,
      "c4nc": 855,
      "cc3C2": 856,
      "oc2cc": 857,
      "2CO1": 858,
      "Sc2ccc": 859,
      "c1ccccc12": 860,
      "c2nc3cc": 861,
      "nc2ccccc2c1": 862,
      "Nc1ncc": 863,
      "2CCCCCC2": 864,
      "ccc1OCC": 865,
      "ccc2OC": 866,
      "ccc2o1": 867,
      "NC2CC": 868,
      "c2ccnc": 869,
      "CO1": 870,
      "c1ccccc1O": 871,
      "1CNC": 872,
      "Nc1ccccc1F": 873,
      "CN2CCO": 874,
      "c2sc3c": 875,
      "NCc3ccc": 876,
      "NC3CC3": 877,
      "Clc1ccc": 878,
      "nc2s1": 879,
      "c2cnccn2": 880,
      "CCc1ccccc1NC": 881,
      "NCCS": 882,
      "NCc1cccnc1": 883,
      "NCCCC": 884,
      "cccnc12": 885,
      "n3ccnc3": 886,
      "oc12": 887,
      "n2cnnn2": 888,
      "2S": 889,
      "c2ccccc2O": 890,
      "c2n1CC": 891,
      "C2CCOCC2": 892,
      "noc2C": 893,
      "cc3Cl": 894,
      "CN1CCOCC1": 895,
      "Cc1ccccc1Cl": 896,
      "c1ccoc1": 897,
      "c4ccco4": 898,
      "cccc21": 899,
      "c2ccoc2": 900,
      "Cn1ccnc1": 901,
      "c1cc2ccccc2o1": 902,
      "Oc1cc": 903,
      "Cc1ccncc1": 904,
      "c3cncc": 905,
      "c2cc1C": 906,
      "c2ncnc": 907,
      "CNc1cc": 908,
      "c2ncnc3": 909,
      "Cn1nn": 910,
      "12C": 911,
      "NC1CCC": 912,
      "c2ccn": 913,
      "c2ccc3ccccc3c2": 914,
      "CCCOC": 915,
      "Cc2ccccc2F": 916,
      "CSc1cccc": 917,
      "Cc1nc2c": 918,
      "Cc1cncc": 919,
      "Cc2ccccc2Cl": 920,
      "CCc3ccccc3": 921,
      "COc2ccccc2": 922,
      "n3n2": 923,
      "sc2n1": 924,
      "CC2CC2": 925,
      "COC2": 926,
      "Nc1nccs1": 927,
      "Sc1n": 928,
      "oc2ccccc12": 929,
      "c3ccsc3": 930,
      "OCc2ccc": 931,
      "CCOc1c": 932,
      "ccc2n1": 933,
      "5c": 934,
      "NCc1nc": 935,
      "c3n2": 936,
      "c2cccc3ccccc23": 937,
      "3c": 938,
      "Nc4ccc": 939,
      "CCc2ccc": 940,
      "COCCN1C": 941,
      "c2cs": 942,
      "cc3c": 943,
      "n3cncn3": 944,
      "OCc1ccccc1": 945,
      "C2CCC": 946,
      "1c1cc": 947,
      "Sc1ccc": 948,
      "nc2nc": 949,
      "NCCc1c": 950,
      "Cc1nc2cc": 951,
      "2c2cccc": 952,
      "3CS": 953,
      "nnc3": 954,
      "3CCCN": 955,
      "N4CCOCC4": 956,
      "c2O": 957,
      "2CCOC3": 958,
      "nc32": 959,
      "Cc2nnc": 960,
      "c2c3c": 961,
      "NCc1ccc2c": 962,
      "COCc1cc": 963,
      "cc2c": 964,
      "(=[": 965,
      "NC2CCCC2": 966,
      "1CCCCN": 967,
      "cc3s2": 968,
      "oc3": 969,
      "NCc1c": 970,
      "NCc2ccco2": 971,
      "n1n": 972,
      "c3cccc4": 973,
      "Cc1cs": 974,
      "c1oc": 975,
      "c2nnn": 976,
      "c1S": 977,
      "COc2cccc": 978,
      "2CCCCC": 979,
      "c4cccs4": 980,
      "c1cnccn1": 981,
      "Cc2ccc3c": 982,
      "nc2sc": 983,
      "Cn1n": 984,
      "c3sc": 985,
      "CCOc1ccccc1NC": 986,
      "ccc2O": 987,
      "c1nnc2ccccn12": 988,
      "c1nc2ccccc2c": 989,
      "CCSC": 990,
      "Nc2cnn": 991,
      "n1cccc1": 992,
      "c1nc2cc": 993,
      "c3ccccc3O2": 994,
      "c1Br": 995,
      "Nc1ccccc1Cl": 996,
      "nc2ccc": 997,
      "2CCC2": 998,
      "CS2": 999,
      "oc2C": 1000,
      "n1N": 1001,
      "N4CCCC4": 1002,
      "c3nccs3": 1003,
      "N1CCc2c": 1004,
      "N2CCCN": 1005,
      "cn12": 1006,
      "c2ncccc2C": 1007,
      "1c1cccs1": 1008,
      "cnc12": 1009,
      "OC2CCCC2": 1010,
      "nnc2": 1011,
      "3CCS": 1012,
      "CCCO4": 1013,
      "C2CCC2": 1014,
      "C3C": 1015,
      "c4ccccc4c3": 1016,
      "c1cs": 1017,
      "c1C1CC1": 1018,
      "n1cncn1": 1019,
      "CN3C": 1020,
      "c3noc": 1021,
      "NCCN1C": 1022,
      "CCc1ncc": 1023,
      "c1nc2ccc": 1024,
      "CCOC2": 1025,
      "N1N": 1026,
      "nc3C": 1027,
      "1COCCN1C": 1028,
      "noc1C": 1029,
      "n2nnnc2": 1030,
      "c2ncccc2c1": 1031,
      "Nc3c": 1032,
      "c2ccccc2Br": 1033,
      "cc2Br": 1034,
      "2c3c": 1035,
      "Nc1s": 1036,
      "c2ccccc2NC": 1037,
      "1C1CC1": 1038,
      "ccc3C": 1039,
      "c1OCC": 1040,
      "CNc1nc": 1041,
      "CSC1": 1042,
      "3CC4CC": 1043,
      "COc1ccc2nc": 1044,
      "Cn1cnc": 1045,
      "c1cc2cccc": 1046,
      "N2CCOC": 1047,
      "N1S": 1048,
      "n1Cc1ccccc1": 1049,
      "nn32": 1050,
      "Cn1cccn1": 1051,
      "N1c1ccccc1": 1052,
      "Cc2cnc": 1053,
      "c2nnc3n": 1054,
      "cs3": 1055,
      "N1CCc2ccccc2C1": 1056,
      "N2CCC3": 1057,
      "c4cccnc4": 1058,
      "ccccc34": 1059,
      "NO": 1060,
      "c1ccc2nc": 1061,
      "c4c3": 1062,
      "2CCCN2": 1063,
      "Cc2cccc3": 1064,
      "Sc1nc": 1065,
      "CN3CCOCC3": 1066,
      "1Cc2cc": 1067,
      "Nc3ccc4c": 1068,
      "cnc1": 1069,
      "CCc1cnc": 1070,
      "NC4": 1071,
      "COCCC": 1072,
      "N1CCc2ccc": 1073,
      "Nn1c": 1074,
      "on3": 1075,
      "NCC1CCN": 1076,
      "3O": 1077,
      "ccn2": 1078,
      "c1nnn": 1079,
      "CS1": 1080,
      "N3CCCCCC3": 1081,
      "Nc2cccc3": 1082,
      "c5ccc": 1083,
      "3CCO": 1084,
      "COCc1ccc": 1085,
      "1CCc2ccccc21": 1086,
      "1CCc2ccccc2C1": 1087,
      "C12CC3CC": 1088,
      "Nc2ccccc2F": 1089,
      "COc3ccc": 1090,
      "NCc1cccs1": 1091,
      "nc2sc3c": 1092,
      "n3cccc3": 1093,
      "COc1ccc2cc": 1094,
      "Cc1ccccc1O": 1095,
      "c2nc3ccccc3o2": 1096,
      "sc2cc": 1097,
      "COC1": 1098,
      "n1ncc": 1099,
      "ccc1S": 1100,
      "Nc2cccnc2": 1101,
      "CCCN2C": 1102,
      "CCOc1ccccc1C": 1103,
      "cccc4": 1104,
      "c4ccccc4C": 1105,
      "Sc2nnc": 1106,
      "CCSC2": 1107,
      "c1ccccc1N": 1108,
      "c2nccn2C": 1109,
      "Cc1sc2nc": 1110,
      "Oc3ccc": 1111,
      "ncc1C": 1112,
      "CNc2cc": 1113,
      "c3ccccc3OC": 1114,
      "COc1ccccc1CNC": 1115,
      "Cc2ccncc2": 1116,
      "COc1ncc": 1117,
      "COCCCNC": 1118,
      "n3ccccc3": 1119,
      "c1cc2cc": 1120,
      "n4c": 1121,
      "CCCc1nc": 1122,
      "cc2OC": 1123,
      "Cc1nccn1": 1124,
      "nc3cc": 1125,
      "2CCCCO2": 1126,
      "-])/": 1127,
      "CSc2nc": 1128,
      "Nc1ccnn1": 1129,
      "c4ccccc4C3": 1130,
      "c3cnccn3": 1131,
      "OCCCO3": 1132,
      "NCc2cccnc2": 1133,
      "COCCn1c": 1134,
      "CSc2ccc": 1135,
      "NCCC1": 1136,
      "SCCC": 1137,
      "COc2cc": 1138,
      "N1CC2": 1139,
      "2CCCc3ccccc32": 1140,
      "NCCc1ccccc1": 1141,
      "cccn4": 1142,
      "n1nnnc1": 1143,
      "CCCl": 1144,
      "c3ccccn23": 1145,
      "c3csc": 1146,
      "ncc4": 1147,
      "CCSC1": 1148,
      "sc2C": 1149,
      "Nc1ccc2": 1150,
      "c3nc4ccccc4s3": 1151,
      "1c2ccccc2C": 1152,
      "c4n": 1153,
      "nn23": 1154,
      "2c3ccccc3C": 1155,
      "Oc3ccccc3": 1156,
      "CN3CC": 1157,
      "CSC2": 1158,
      "n4cc": 1159,
      "CCc1ccsc1": 1160,
      "Nc1nc2ccc": 1161,
      "Fc1cccc": 1162,
      "1Cc1ccc": 1163,
      "nc2scc": 1164,
      "3CO": 1165,
      "NN2C": 1166,
      "CCc2c": 1167,
      "c1cnn2": 1168,
      "COC3": 1169,
      "c3cn": 1170,
      "N12": 1171,
      "c2nnc3n2CC": 1172,
      "\\[": 1173,
      "CCc1o": 1174,
      "1CCC2": 1175,
      "Cc1ccc2": 1176,
      "cc3c2": 1177,
      "c1nc2ccccc2n1C": 1178,
      "1CCCCN1S": 1179,
      "Nc2ncc": 1180,
      "c3o": 1181,
      "COC1CCN": 1182,
      "Cc1no": 1183,
      "c4ccccn4": 1184,
      "Nc2ccc3": 1185,
      "c1nnc2n1CC": 1186,
      "cccc2C": 1187,
      "nnc1S": 1188,
      "Cc4ccc": 1189,
      "Cn2cccn2": 1190,
      "CC1CCCCC1": 1191,
      "OCc1ccc": 1192,
      "C3CCN": 1193,
      "NCc1ccnc": 1194,
      "1COC": 1195,
      "Nc2cn": 1196,
      "CCn2c": 1197,
      "COc1nc": 1198,
      "NCCc2ccc": 1199,
      "1Cc2ccccc2O1": 1200,
      "nc3ccccc23": 1201,
      "nc3s": 1202,
      "c1c2c": 1203,
      "c1coc": 1204,
      "Cc2ccccc2C1": 1205,
      "n2cnnc2": 1206,
      "C5": 1207,
      "OCc3ccccc3": 1208,
      "1CSCC": 1209,
      "N2CCc3ccccc32": 1210,
      "cccnc23": 1211,
      "Cc1nc2ccc": 1212,
      "1CN2CCCC": 1213,
      "ccc3c2": 1214,
      "ccc3C2": 1215,
      "CC1CCCC1": 1216,
      "c3ccccc3O": 1217,
      "c2no": 1218,
      "2COc3ccccc3O2": 1219,
      "c3cccnc32": 1220,
      "1CC2": 1221,
      "n1ncc2": 1222,
      "nn4": 1223,
      "OCCNC": 1224,
      "CCc1cccs1": 1225,
      "Cc1nccs1": 1226,
      "1c1ccco1": 1227,
      "Nc2nccs2": 1228,
      "NCc2c": 1229,
      "c3C2": 1230,
      "CCCc1ccc": 1231,
      "CC1CCC1": 1232,
      "n2ccccc2": 1233,
      "3CCOC3": 1234,
      "Cn1ncc": 1235,
      "1CCOc2ccccc21": 1236,
      "Cc3cccnc3": 1237,
      "Cc3cccs3": 1238,
      "4CCCO4": 1239,
      "Nc3ccccc3C": 1240,
      "c1CN": 1241,
      "CCN3C": 1242,
      "COc1ccc2": 1243,
      "cn1C": 1244,
      "Cc2ccccc2C": 1245,
      ")-": 1246,
      "Nc2nc3c": 1247,
      "CCCCn1c": 1248,
      "NCc3ccccc3": 1249,
      "Cc3ccco3": 1250,
      "nc4ccccc4": 1251,
      "4CCCC": 1252,
      "Nc2ccccc21": 1253,
      "c1ccc2ccccc2n1": 1254,
      "ncnc1": 1255,
      "2CCCCN2C": 1256,
      "CN3CCN": 1257,
      "CCOCCN": 1258,
      "CCN1CCO": 1259,
      "ccc2O1": 1260,
      "c4ccccc4F": 1261,
      "c2cnn3": 1262,
      "Cc1cc2nc": 1263,
      "CCc1nc2n": 1264,
      "12CCC": 1265,
      "Oc2ccccc21": 1266,
      "c2ccc3": 1267,
      "c2ccccc2c1C": 1268,
      "2Cc3ccccc3": 1269,
      "n2ccnn2": 1270,
      "Oc1ccc2c": 1271,
      "NC2CCN": 1272,
      "CCC1CCC": 1273,
      "CCCCS": 1274,
      "Nc1cn": 1275,
      "c2scc": 1276,
      "Cc1occc1C": 1277,
      "CBr": 1278,
      "+]\\": 1279,
      "n2ncc": 1280,
      "c2sccc2C": 1281,
      "sc2c1CCCC2": 1282,
      "c4ccncc4": 1283,
      "sc3c2": 1284,
      "n1ccc": 1285,
      "cc2NC1": 1286,
      "Nc1ccn": 1287,
      "nnc1SCC": 1288,
      "Cc1onc": 1289,
      "1c1nc": 1290,
      "COCc1cccc": 1291,
      "CCCCCC": 1292,
      "SCc2ccc": 1293,
      "nc3nc": 1294,
      "Nc3": 1295,
      "](/": 1296,
      "Cc1ccccc1OCC": 1297,
      "c2nc3ccccc3c": 1298,
      "Cn1ncnc1": 1299,
      "c2sccc2C1": 1300,
      "CCc1onc": 1301,
      "4CCC": 1302,
      "nc3ccccc3c2": 1303,
      "CSc1ncc": 1304,
      "Nc1ccc2nc": 1305,
      "n1ccnc1": 1306,
      "1Cc2ccccc2N1C": 1307,
      "NCc2nc": 1308,
      "NCc2ccc3c": 1309,
      "c3ccoc3": 1310,
      "c1nnc2n1": 1311,
      "N3CCCC": 1312,
      "sc2C1": 1313,
      "1SC": 1314,
      "N1CCS": 1315,
      "C1CCSCC1": 1316,
      "c3nnc4": 1317,
      "c1cccc2cccnc12": 1318,
      "c2nnc3n2CCCCC3": 1319,
      "Cc2noc": 1320,
      "Oc1ccccc1C": 1321,
      "sc3nc": 1322,
      "NC2CCC": 1323,
      "CO3": 1324,
      "C1c2ccccc2C": 1325,
      "n2ccc": 1326,
      "CCOC1": 1327,
      "c2cc3ccccc3o2": 1328,
      "ccn1C": 1329,
      "NC3CCCC3": 1330,
      "c2ccccc23": 1331,
      "CNc1cccc": 1332,
      "cc2NC": 1333,
      "ccc2N1": 1334,
      "1COc2ccccc21": 1335,
      "COc1cccc2cc": 1336,
      "1SCC": 1337,
      "2OCC": 1338,
      "3CO2": 1339,
      "Cc3ccccn3": 1340,
      "COCCn1cc": 1341,
      "CN2CCCC2": 1342,
      "N4CCC": 1343,
      "Cc3nc": 1344,
      "NCCCO": 1345,
      "Sc1ccccc1": 1346,
      "oc2ccccc21": 1347,
      "NCc1ccccn1": 1348,
      "NCc1csc": 1349,
      "cc2O": 1350,
      "1CCCN1S": 1351,
      "Cc1ccc2ncc": 1352,
      "CCOC3": 1353,
      "Nc1ccccn1": 1354,
      "CCSc1ccc": 1355,
      "Cn3c": 1356,
      "S3": 1357,
      "CCCCN1C": 1358,
      "Cc2ccsc2": 1359,
      "CCCn1nc": 1360,
      "n2N": 1361,
      "n2C2CC2": 1362,
      "c2cc3cc": 1363,
      "NO1": 1364,
      "NCc1ccccc1Cl": 1365,
      "NC3CCCCC3": 1366,
      "c1ccccc1S": 1367,
      "c1nnnn1": 1368,
      "N2CCOC2": 1369,
      "nc1N": 1370,
      "Nc1cccc2ccccc12": 1371,
      "2OC": 1372,
      "c13": 1373,
      "NC1CCCCCC1": 1374,
      "cc1CN": 1375,
      "c3cnc": 1376,
      "Nc1ccccc1OC": 1377,
      "c2nn3c": 1378,
      "c1nnc2n1CCCCC2": 1379,
      "@]([": 1380,
      "Sc2ccccc2": 1381,
      "ccn2C": 1382,
      "CCOc1ccc2c": 1383,
      "N1CSC": 1384,
      "N2N": 1385,
      "1CCSC1": 1386,
      "sc3n2": 1387,
      "c3cc4ccccc4": 1388,
      "n1nccc1NC": 1389,
      "4C3": 1390,
      "CCc2nc": 1391,
      "c2c1nc": 1392,
      "CN2": 1393,
      "CCOc2ccc": 1394,
      "2C2CC2": 1395,
      "nnn3": 1396,
      "CCn1nn": 1397,
      "CCSc1nnc": 1398,
      "Cc3ccccc3F": 1399,
      "Cc1cccc2ccccc12": 1400,
      "1c1ccc2c": 1401,
      "3N": 1402,
      "CC2CCCCC2": 1403,
      "C1O": 1404,
      "1CCCO": 1405,
      "N2CCc3ccccc3C2": 1406,
      "Cc2cnn": 1407,
      "c3cc4c": 1408,
      "CON": 1409,
      "2CC3": 1410,
      "cc2N": 1411,
      "cc2o1": 1412,
      "c1cccc2c1N": 1413,
      "Nc1sc2c": 1414,
      "Fc1cc": 1415,
      "sc4": 1416,
      "+]/": 1417,
      "cc2N1": 1418,
      "2Cc2ccccc2": 1419,
      "Cc1ccsc1C": 1420,
      "Cc1nnnn1": 1421,
      "N1CCCc2cc": 1422,
      "1CN2CCC": 1423,
      "COc1ccccc1N1CCN": 1424,
      "c3nc4c": 1425,
      "c1scnc1C": 1426,
      "Oc3cc": 1427,
      "CC2CC": 1428,
      "NCc3ccco3": 1429,
      ")(/": 1430,
      "COc1cc2": 1431,
      "Cc1ccccc1CNC": 1432,
      "Cc1ncsc1": 1433,
      "N1c1cccc": 1434,
      "c1cc2n": 1435,
      "Nc1cnc": 1436,
      "NN1C": 1437,
      "@@]([": 1438,
      "CCOc1cc2c": 1439,
      "NCC2CCN": 1440,
      "Cc1cn2c": 1441,
      "Cn1cncn1": 1442,
      "Nc2ccccc2Cl": 1443,
      "1c1ccccc1F": 1444,
      "OCc2nc": 1445,
      "2CCCc3cc": 1446,
      "c1ncn": 1447,
      "COCc1nc": 1448,
      "ccc2n1C": 1449,
      "CCn1ccc": 1450,
      "1CSCN1C": 1451,
      "cnn2": 1452,
      "cnc21": 1453,
      "ns": 1454,
      "CC3CC3": 1455,
      "cc1c32": 1456,
      "n2nnc": 1457,
      "CCCOc1cccc": 1458,
      "Fc1ccccc1": 1459,
      "CCN1CCOCC1": 1460,
      "5ccccc5": 1461,
      "Nc2sc3c": 1462,
      "cnc2c1": 1463,
      "CCCc1c": 1464,
      "n2ncc3": 1465,
      "nc34": 1466,
      "c2nnc3ccccn23": 1467,
      "Oc1ccccc1F": 1468,
      "n3CC": 1469,
      "cc5": 1470,
      "OCc2cc": 1471,
      "CNc2cccc": 1472,
      "n1CCNC": 1473,
      "2CCN1CC2": 1474,
      "Cn1nnc": 1475,
      "ccc2C1": 1476,
      "1COCCO1": 1477,
      "c1nnc2n1CCC2": 1478,
      "1c1c": 1479,
      "NNc1ccc": 1480,
      "C23CC4CC": 1481,
      "N2CCS": 1482,
      "Cc2cn": 1483,
      "c1nc2ccccc2o1": 1484,
      "c2nc3ccccc3n2C": 1485,
      "cccc3F": 1486,
      "Cn2cncn2": 1487,
      "Nc2ncnc": 1488,
      "c3nnnn3C": 1489,
      "2SCC": 1490,
      "CCc2cc": 1491,
      "CC2CCCC2": 1492,
      "1CCCCCCC1": 1493,
      "CCn1cnnc1": 1494,
      "2c2cccs2": 1495,
      "co2": 1496,
      "oc2ccc": 1497,
      "NCc1ncc": 1498,
      "NCc1ccccc1F": 1499,
      "c2ccccc2S1": 1500,
      "CC2CCC2": 1501,
      "CCCCCC1": 1502,
      "OCO5": 1503,
      "Cn1cnc2c": 1504,
      "ccc3o2": 1505,
      "Nc1ncnc": 1506,
      "N4CCCCC4": 1507,
      "c2cscn2": 1508,
      "Oc1c": 1509,
      "Cc1cccn2c": 1510,
      "c4ncc": 1511,
      "COC1CC": 1512,
      "(/[": 1513,
      "Cc1ccccc1OC": 1514,
      "CCSC3": 1515,
      "Cn1cnnc1": 1516,
      "ccc3n2": 1517,
      "cccc32": 1518,
      "nc2n": 1519,
      "CCCCO": 1520,
      "c3ccccc13": 1521,
      "N1CCSCC1": 1522,
      "CSc1ccccc1": 1523,
      "N2CCSCC2": 1524,
      "Cc1cnc2c": 1525,
      "2CCCN2S": 1526,
      "oc3c2": 1527,
      "CCc1": 1528,
      "COc3ccccc3": 1529,
      "N1CCc2": 1530,
      "n3c2": 1531,
      "Nc1ccc2oc": 1532,
      "ncccc12": 1533,
      "c1nccn1C": 1534,
      "c3ncnc4": 1535,
      "Cn1cccc1": 1536,
      "Cc1ncccc1NC": 1537,
      "Cc1nc2ccccc2s1": 1538,
      "2CCCc3cccc1c32": 1539,
      "2c1ccc": 1540,
      "2SC": 1541,
      "Cn3cc": 1542,
      "Nc3ccccc32": 1543,
      "cccc12": 1544,
      "2CCc3ccccc32": 1545,
      "OC2CCC2": 1546,
      "N1CCCCC": 1547,
      "c2nc3n": 1548,
      "NCCc1cccc": 1549,
      "N1Cc1ccccc1": 1550,
      "CCCCCC2": 1551,
      "SCc2cc": 1552,
      "Cc1ncn": 1553,
      "c2ccccn2c1": 1554,
      "CCOc1ccc2nc": 1555,
      "n3ccccc3n2": 1556,
      "cc2c1C": 1557,
      "nnc1C": 1558,
      "NCCc1cccs1": 1559,
      "ccc2Br": 1560,
      "c4ccccc4Cl": 1561,
      "sc1NC": 1562,
      "cccc3Cl": 1563,
      "1CSc2ccccc21": 1564,
      "NCc2cccs2": 1565,
      "CCN2CCOCC2": 1566,
      "N2CCNC": 1567,
      "Cc1nsc": 1568,
      "Cc1coc": 1569,
      "Cc1cccc2c": 1570,
      "N3CCO": 1571,
      "CCSCC2": 1572,
      "ccc3F": 1573,
      "Cc3ccccc3Cl": 1574,
      "c1cccc2cc": 1575,
      "CSc1nnnn1": 1576,
      "3CN": 1577,
      "Cc3ccc4c": 1578,
      "COCCOc1ccc": 1579,
      "ccc2s1": 1580,
      "nc3n": 1581,
      "c4ccc5c": 1582,
      "n1cnnn1": 1583,
      "Cc3ccccc3C2": 1584,
      "1COc2ccc": 1585,
      "Nc1cccnc1Cl": 1586,
      "Cn1nnnc1": 1587,
      "oc3cc": 1588,
      "CCc1ccc2c": 1589,
      "CCCc2ccccc2": 1590,
      "n2n": 1591,
      "NCCc2ccccc2": 1592,
      "nc3c2c": 1593,
      "cc4c3": 1594,
      "Cn1ncc2c": 1595,
      "2c2cc": 1596,
      "cnc23": 1597,
      "c1ccc2cc": 1598,
      "COc1ccc2ccccc2c1": 1599,
      "CCn1ncc": 1600,
      "Nc1ccccc1Br": 1601,
      "c3sc4c": 1602,
      "1CSCCS1": 1603,
      "oc2c": 1604,
      "CCCc1ccccc1": 1605,
      "n2Cc2ccccc2": 1606,
      "c3ccccc31": 1607,
      "nnc12": 1608,
      "CSc2n": 1609,
      "N2CCc3cc": 1610,
      "COc1ccccc1N1C": 1611,
      "c4ccccc4O3": 1612,
      "c2ncco2": 1613,
      "Cc2cc3": 1614,
      "n3cnnn3": 1615,
      "1Cc2ccccc2S1": 1616,
      "n2ccccc2n1": 1617,
      "c1scnc1C1CC1": 1618,
      "1Cl": 1619,
      "Oc2c": 1620,
      "Oc2cccnc2": 1621,
      "oc3C": 1622,
      "c2c1c": 1623,
      "CCCc1nnc": 1624,
      "c2ccccc2S": 1625,
      "c1ccccc1OCC": 1626,
      "nc1Cl": 1627,
      "Nc1ccncc1": 1628,
      "1c1cccnc1": 1629,
      "nn3c2": 1630,
      "c1ccncc1Cl": 1631,
      "+])([": 1632,
      "c3ccn": 1633,
      "OCc2cccc": 1634,
      "cc2n1": 1635,
      "Cc1ccoc1": 1636,
      "CNC1": 1637,
      "N2CCNC2": 1638,
      "nc1NC": 1639,
      "C3CCC3": 1640,
      "N2CCCc3ccccc32": 1641,
      "c2ncccc12": 1642,
      "cccc2s1": 1643,
      "noc3C": 1644,
      "Cn2ccc": 1645,
      "Cc1occc1": 1646,
      "Cc1nc2ccccc2c": 1647,
      "SCC3": 1648,
      "CCSCC": 1649,
      "NCc3cccc": 1650,
      "c2cc1OC": 1651,
      "cc1N1C": 1652,
      "c2cccnc12": 1653,
      "1CCCc2ccc": 1654,
      "N1CCCc2ccccc21": 1655,
      "Nc1cc2c": 1656,
      "Cn1cccc1C": 1657,
      "c2cc3cccc": 1658,
      "ccccc21": 1659,
      "NCc2ccnc": 1660,
      "Cc2cccc3ccccc23": 1661,
      "Cc2": 1662,
      "onc": 1663,
      "ccn": 1664,
      "1CCCCN1": 1665,
      "Clc1cccc": 1666,
      "OCc1cc": 1667,
      "n21": 1668,
      "CCS1": 1669,
      "c2sccc21": 1670,
      "1c1ccccc1Cl": 1671,
      "Nc4ccccc4": 1672,
      "cnc": 1673,
      "CCc2ccccc21": 1674,
      "CCCCOc1ccc": 1675,
      "COCCOC": 1676,
      "OCc3ccc": 1677,
      "OCc2cccnc2": 1678,
      "c2ccccc2N1": 1679,
      "1CCCc2cccnc21": 1680,
      "CSCc1ccc": 1681,
      "CSc2nn": 1682,
      "Cc1nc2n": 1683,
      "n2cnc3ccccc32": 1684,
      "c3ncn": 1685,
      "3CCCN3C": 1686,
      "c1nc2ccccc2n1CC": 1687,
      "n4cccn4": 1688,
      "c1cccc2c1": 1689,
      "1OC1CCCC1": 1690,
      "c3cccc4ccccc34": 1691,
      "Cc1cscc1C": 1692,
      "CCNc1cc": 1693,
      "NCCc2c": 1694,
      "OCC2CC2": 1695,
      "CN2CCOC": 1696,
      "c1nnc2c": 1697,
      "c2cnn3C": 1698,
      "sc2c1CC": 1699,
      "12CCc1ccccc12": 1700,
      "5CC": 1701,
      "Cc2n": 1702,
      "Cc2ncc": 1703,
      "cn2C": 1704,
      "CCC1CCCC1": 1705,
      "1CCc2cc": 1706,
      "ncnc21": 1707,
      "CCN1CCC": 1708,
      "CSc3nnc": 1709,
      "3C4": 1710,
      "c2cncnc2": 1711,
      "CCc1ccccn1": 1712,
      "c2OC": 1713,
      "NCc1ccncc1": 1714,
      "c4C": 1715,
      "OCCCC": 1716,
      "COc1ccnc": 1717,
      "1CN1CCOCC1": 1718,
      "cc43": 1719,
      "cccc3s2": 1720,
      "c3nc4ccc": 1721,
      "Cn2ccnc2": 1722,
      "CCCn1ccnn1": 1723,
      "21C": 1724,
      "Cn3": 1725,
      "Nc3ccccc3F": 1726,
      "nc2ccccn12": 1727,
      "oc3ccccc32": 1728,
      "c1c2ccccc2": 1729,
      "COc2ccccc2C": 1730,
      "n1nnc": 1731,
      "c43": 1732,
      "2CCC3": 1733,
      "Cc1ncnn1C": 1734,
      "COc1ccccc1F": 1735,
      "n2ccsc2n1": 1736,
      "c1nc2ccccc2n1": 1737,
      "1SCCC": 1738,
      "oc2c1C": 1739,
      "nc4ccccc43": 1740,
      "23CC": 1741,
      "CCCCCNC": 1742,
      "2CCc3c": 1743,
      "2CSCC": 1744,
      "n32": 1745,
      "N1Cc1ccc": 1746,
      "CCn1n": 1747,
      "nc3n2": 1748,
      "ccc3Cl": 1749,
      "Nc2ccccc2OC": 1750,
      "Cn2nn": 1751,
      "c1cc2ccccc2oc1": 1752,
      "nnc3s2": 1753,
      "23C": 1754,
      "2CN1C": 1755,
      "4c": 1756,
      "Nc4cccc": 1757,
      "nn2c": 1758,
      "COCCO": 1759,
      "1CCc2nc": 1760,
      "1CCc2cccnc21": 1761,
      "C1S": 1762,
      "C3CCOCC3": 1763,
      "n2ccccc12": 1764,
      "c1cscn1": 1765,
      "c3sccc32": 1766,
      "Cc1ccncc1NC": 1767,
      "1c1ccccc1C": 1768,
      "43": 1769,
      "Sc2nc": 1770,
      "ns1": 1771,
      "ccc2c": 1772,
      "c2O1": 1773,
      "NCc3ccc4c": 1774,
      "NC2CCCCCC2": 1775,
      "1CSC": 1776,
      "CSc1cc": 1777,
      "COc1ccccc1CC": 1778,
      "c3nccc": 1779,
      "c1cc2ccc": 1780,
      "cccc2c1": 1781,
      "C4CCCCC4": 1782,
      "nc4c": 1783,
      "N4CCN": 1784,
      "2COc3ccccc32": 1785,
      "c1sccc1C": 1786,
      "1c2cc": 1787,
      "NCCOc1ccc": 1788,
      "Sc1ccccn1": 1789,
      "1CCc2sc": 1790,
      "C12": 1791,
      "C12CC": 1792,
      "c1nccc": 1793,
      "Cc1ccon1": 1794,
      "N2CCc3c": 1795,
      "NCCc1nc": 1796,
      "NCC1CC1": 1797,
      "Cc1ccccc1Br": 1798,
      "c2c1CCC2": 1799,
      "2CCCCCCC2": 1800,
      "Nc2ccccn2": 1801,
      "cn23": 1802,
      "1CSCCO1": 1803,
      "NCCN1CCOCC1": 1804,
      "2Nc3ccc": 1805,
      "3OC": 1806,
      "Nc3nnc": 1807,
      "O4": 1808,
      "coc2c1": 1809,
      "ccn1CC": 1810,
      "NCc2ccccn2": 1811,
      "COCCCN1C": 1812,
      "1CCNC": 1813,
      "C2S": 1814,
      "N1CCNC": 1815,
      "CSc1ccccc1NC": 1816,
      "ccc1CNC": 1817,
      "3CCCCCC3": 1818,
      "COc1ccc2oc": 1819,
      "Cc1ccccc1N1C": 1820,
      "COc1ccccc1CN": 1821,
      "Nc1ccccc1N1CCCC1": 1822,
      "1Oc2ccc": 1823,
      "c1cnc2c": 1824,
      "1NS": 1825,
      "4CCOCC4": 1826,
      "NNS": 1827,
      "nc3ccc": 1828,
      "CCCCOC": 1829,
      "c3c4c": 1830,
      "n1Cc1ccco1": 1831,
      "2CCc3ccccc3C2": 1832,
      "OC1CCCC1": 1833,
      "Cc1ccc2oc": 1834,
      "N1CCc2sccc2C1": 1835,
      "N2CCc3ccc": 1836,
      "Cc1nnc2n1": 1837,
      "COc1ccccc1N": 1838,
      "Cc1cc2cc": 1839,
      "c3nnnn3": 1840,
      "n1nnc2ccccc21": 1841,
      "Cn1ncc2c1CCC": 1842,
      "2N1": 1843,
      "NCc2ncc": 1844,
      "NCc2ccccc2Cl": 1845,
      "ncnc2s1": 1846,
      "OCc2ccccc2F": 1847,
      "c1nn2c": 1848,
      "CCOc2ccccc2": 1849,
      "CCNc1nc": 1850,
      "CNC2": 1851,
      "C1CCS": 1852,
      "Cc1ncccc1C": 1853,
      "Cn2nnc": 1854,
      "COc1cccc2c1OC": 1855,
      "2c2ccccc2F": 1856,
      "Cc2nccs2": 1857,
      "NNc1cccc": 1858,
      "c1ccc2oc": 1859,
      "NCc2ccccc2C": 1860,
      "c3Cl": 1861,
      "CCCc1noc": 1862,
      "c1ccccc1C2": 1863,
      "1CCCS1": 1864,
      "1CCCOC1": 1865,
      "c4nnc": 1866,
      "Cc1ccc2cc": 1867,
      "nnn1C": 1868,
      "2CCCc3": 1869,
      "nc2c1C": 1870,
      "NCCOC": 1871,
      "n34": 1872,
      "COc1ccccc1OCC": 1873,
      "CCS2": 1874,
      "Nc2ccnn2": 1875,
      "n4C": 1876,
      "CCc1ccsc1CNC": 1877,
      "Cc2ccccc21": 1878,
      "CCCN1CC": 1879,
      "2CCCCN": 1880,
      "1Cc1cccc": 1881,
      "1C1CCCCC1": 1882,
      "c3ccccc3Br": 1883,
      "Brc1ccc": 1884,
      "SCc2ccccc2": 1885,
      "nn2c1": 1886,
      "CCc1ccco1": 1887,
      "NCCCn1cc": 1888,
      "sc1Br": 1889,
      "Cc2ccon2": 1890,
      "1COc2ccccc2C1": 1891,
      "N4C": 1892,
      "sc2c1CCC2": 1893,
      "Nc3ncnn32": 1894,
      "1c2ccccc2": 1895,
      "SC3": 1896,
      "COc1ncccc1C": 1897,
      "c3ccc4ccccc4c3": 1898,
      "c2ccccc2NC1": 1899,
      "CNCC": 1900,
      "CN3CCC": 1901,
      "cc2ccccc21": 1902,
      "c1ncccn1": 1903,
      "2CNC": 1904,
      "CSC3": 1905,
      "cc34": 1906,
      "ccc2N": 1907,
      "c2cccc3cccnc23": 1908,
      "Sc1nnnn1": 1909,
      "1NN": 1910,
      "Cn3nc": 1911,
      "cnn2C": 1912,
      "CCn2cc": 1913,
      "NC1C": 1914,
      "c2ccc3ccccc3n2": 1915,
      "CCCc1n": 1916,
      "c1cccn1": 1917,
      "C12CCC2": 1918,
      "OC2CCCCC2": 1919,
      "CSc1ccccc1C": 1920,
      "NCC3": 1921,
      "NCCc1ccccn1": 1922,
      "C2CCSCC2": 1923,
      "CCCCc1ccc": 1924,
      "nc3sc": 1925,
      "ncc2ccccc12": 1926,
      "ccc3OC": 1927,
      "cc4c": 1928,
      "NC12CC3CC": 1929,
      "c1cccc2ncccc12": 1930,
      "c1cccnc1Cl": 1931,
      "c3ncccc3C": 1932,
      "c2cccc3c2": 1933,
      "2CSc3ccccc32": 1934,
      "2Nc3c": 1935,
      "NNc2ccc": 1936,
      "Oc2ccc3c": 1937,
      "Oc1ccccc1Cl": 1938,
      "c2ccc3nnc": 1939,
      "cc1I": 1940,
      "1CCOC": 1941,
      "c2ncc3c": 1942,
      "nc2N": 1943,
      "n3ncc": 1944,
      "Cn1cccc": 1945,
      "c2nccnc2c1": 1946,
      "N2c3ccccc3C": 1947,
      "3CCCc4": 1948,
      "1CCSc2ccc": 1949,
      "Cc1nccn1C": 1950,
      "2CN3CCCC": 1951,
      "Nc1nncs1": 1952,
      "Cc3csc": 1953,
      "Nc3c2c": 1954,
      "1Br": 1955,
      "1c2ccsc2": 1956,
      "CCc2cccc": 1957,
      "c2s1": 1958,
      "1CCc2": 1959,
      "ccc2OC1": 1960,
      "C2CCCCCC2": 1961,
      "N3CCc4ccccc43": 1962,
      "c2nnc3n2": 1963,
      "cn2n1": 1964,
      "n3ccsc3n2": 1965,
      "c2oc3c": 1966,
      "c2nnnn2C2CC2": 1967,
      "c1ocnc1C": 1968,
      "3COc4ccccc4O3": 1969,
      "2Cc3ccccc3S2": 1970,
      "2N1C": 1971,
      "CCc3ccccc32": 1972,
      "NCc3cc": 1973,
      "NCc1nnc": 1974,
      "CCCc2ccccc21": 1975,
      "COc3cccc": 1976,
      "COc2c": 1977,
      "COCCn1nc": 1978,
      "CN1c1ccccc1": 1979,
      "Cc1ccn2c": 1980,
      "N1CCc2nc": 1981,
      "N2CCCCC": 1982,
      "C1CCc2cc": 1983,
      "C1CCCCCC1": 1984,
      "OCC1CC1": 1985,
      "ccc34": 1986,
      "n4nc": 1987,
      "N4CCCC": 1988,
      "c1sc2ccccc2c1": 1989,
      "c4ncccn4": 1990,
      "1O2": 1991,
      "Cc3ccncc3": 1992,
      "Nc2cnc": 1993,
      "Nc1nc2ccccc2s1": 1994,
      "Sc2ccccc21": 1995,
      "scc": 1996,
      "NCc1ccccc1C": 1997,
      "NC1CCCCCCC1": 1998,
      "c3F": 1999,
      "OCc2ccccn2": 2000,
      "c2ccccc2n2c": 2001,
      "c3ccccc3n12": 2002,
      "CSc1nc2ccccc2c": 2003,
      "ccc1N1CCOCC1": 2004,
      "cc3n2": 2005,
      "COc1ccccc1O": 2006,
      "NCCCOC": 2007,
      "Cc1nnc2ccc": 2008,
      "Cc3ccccc3C": 2009,
      "c1cccc2sc": 2010,
      "c1sc2nc": 2011,
      "c1ccsc1NC": 2012,
      "CCc1nsc": 2013,
      "Cc3cnc": 2014,
      "Cc3cccc4": 2015,
      "NCc2cn": 2016,
      "CONC": 2017,
      "OCc1cccc": 2018,
      "nc1CC": 2019,
      "N2CCCS2": 2020,
      "c2ncccc2Cl": 2021,
      "C4CCCC4": 2022,
      "c1occc1Br": 2023,
      "CCOCC1CC1": 2024,
      "n1ncc2c": 2025,
      "1c2ccc": 2026,
      "2c2ccc3c": 2027,
      "Nc1": 2028,
      "Oc2ccccc2C": 2029,
      "CCCc1nn": 2030,
      "CCC1CC1": 2031,
      "1CCc2ccc": 2032,
      "n2c3c": 2033,
      "C2CN": 2034,
      "COCc1ccccc1": 2035,
      "cc3OC": 2036,
      "nc2c1nc": 2037,
      "Cc1ccccc1CC": 2038,
      "SCc2c": 2039,
      "CCSCC1": 2040,
      "N2c2ccc": 2041,
      "Nc2ccc3nc": 2042,
      "c2nncn2C": 2043,
      "CN2CCS": 2044,
      "ccc3O": 2045,
      "ccc3n2C": 2046,
      "Cc1cccc2nc": 2047,
      "c3sccc3": 2048,
      "c2oc3ccc": 2049,
      "n2ncc3c": 2050,
      "1c": 2051,
      "Oc3ccccc32": 2052,
      "oc4ccc": 2053,
      "sc2c": 2054,
      "NCc2ccncc2": 2055,
      "NCc2csc": 2056,
      "c3s2": 2057,
      "CCCN2": 2058,
      "OCc2nnc": 2059,
      "CCNc1ccc": 2060,
      "2CCCc3ccc": 2061,
      "ccc1N1CCCC1": 2062,
      "nc2Cl": 2063,
      "C1CCCC": 2064,
      "CCOCc1ccc": 2065,
      "Cc1ncsc1C": 2066,
      "N1c2ccccc2C": 2067,
      "OCCO1": 2068,
      "CCn1ccnc": 2069,
      "Cn2cnc": 2070,
      "2CN3CCC": 2071,
      "c1sccc1": 2072,
      "c3nccn3C": 2073,
      "Nc2ncnn2": 2074,
      "1Cc2ccccc2CN1C": 2075,
      "c3nc4ccccc4o3": 2076,
      "Cc1cscc1": 2077,
      "Cc1nnc2n1CCC": 2078,
      ")\\": 2079,
      "1c1ccncc1": 2080,
      "2OC2CCCC2": 2081,
      "nc2cccnc21": 2082,
      "c2cccn2C": 2083,
      "C2N": 2084,
      "Cc1cccnc1C": 2085,
      "CCN3CCOCC3": 2086,
      "Cc1ccc2cccc": 2087,
      "nn1CC": 2088,
      "nc1CNC": 2089,
      "SCc3ccc": 2090,
      "CCSc1nc": 2091,
      "c2ncccc2": 2092,
      "Nc1ccccc1S": 2093,
      "Nc2ccn": 2094,
      "CC1CCOCC1": 2095,
      "Cc1ccsc1CNC": 2096,
      "c2oc3ccccc3": 2097,
      "nc2sccn12": 2098,
      "Cn3cncn3": 2099,
      "Nc2nn": 2100,
      "cnc2s1": 2101,
      "CCc1cc2c": 2102,
      "c1CCCNC": 2103,
      "c1ccc3c": 2104,
      "CCCN1CCO": 2105,
      "COCCCC": 2106,
      "c1nc2n": 2107,
      "Cc1cccn2cc": 2108,
      "CCOCCC": 2109,
      "nnc1C1CC1": 2110,
      "NCCc2cccc": 2111,
      "C1CCCC2": 2112,
      "c1nncn1C": 2113,
      "CCCOc1ccccc1": 2114,
      "N3CCNC3": 2115,
      "c1nnc2n": 2116,
      "3CCCN3": 2117,
      "cc4s3": 2118,
      "cn2c1": 2119,
      "Cn2cnc3c": 2120,
      "c3ccccn3c2": 2121,
      "c3sccc3C2": 2122,
      "nc3scc": 2123,
      "2c2nc": 2124,
      "3S": 2125,
      "4CCCC4": 2126,
      "Nc2": 2127,
      "NCCC2": 2128,
      "ccc2ccccc12": 2129,
      "CCc2ccccn2": 2130,
      "c2o1": 2131,
      "CCCN1CCN": 2132,
      "nc5": 2133,
      "C12CCCC2": 2134,
      "c3ccccc3N": 2135,
      "Cc1ccoc1C": 2136,
      "c2ns": 2137,
      "ccc1CCNC": 2138,
      "NCCS1": 2139,
      "c2c1CC": 2140,
      "c1cnc2ccc": 2141,
      "nc4c3": 2142,
      "c2onc": 2143,
      "c1cscc1Br": 2144,
      "3c3ccccc3": 2145,
      "3c3ccc": 2146,
      "Nc2nc3ccccc3": 2147,
      "sc12": 2148,
      "CC2CCN": 2149,
      "c1N1CCN": 2150,
      "c2ccc3nc": 2151,
      "cc1NCC": 2152,
      "ncn4": 2153,
      "1Cc2": 2154,
      "CCOc2cccc": 2155,
      "NCCc1cc": 2156,
      "NCCc2nc": 2157,
      "nc1S": 2158,
      "ncccc23": 2159,
      "c2nnco2": 2160,
      "c1cccc2c": 2161,
      "CN1CCc2cc": 2162,
      "Nc1cccc2c1": 2163,
      "nc2c1cnn2": 2164,
      "n4ccnc4": 2165,
      "nc3sc4c": 2166,
      "c3cc4ccccc4o3": 2167,
      "1cc": 2168,
      "1c1nc2ccccc2s1": 2169,
      "2c2c": 2170,
      "2c2ccco2": 2171,
      "34": 2172,
      "NN2": 2173,
      "NCc1cn": 2174,
      "NCc3cccnc3": 2175,
      "COc2ccc3c": 2176,
      "COc1ncnc": 2177,
      "c1ccccc1I": 2178,
      "2Cc3cc": 2179,
      "2CCCO": 2180,
      "CSc2ncc": 2181,
      "nc2N1": 2182,
      "CCNC1": 2183,
      "N32": 2184,
      "SCc2cccc": 2185,
      "c2ncccc2F": 2186,
      "sc1Cl": 2187,
      "1COC2": 2188,
      "N4CC": 2189,
      "ccccc45": 2190,
      "1Sc2ccc": 2191,
      "1c1ccccc1OC": 2192,
      "Cn2ncc3": 2193,
      "c1csnn1": 2194,
      "2CSCCS2": 2195,
      "Cc2nc3ccccc3s2": 2196,
      "N1CN": 2197,
      "csc1NC": 2198,
      "CCc2cccs2": 2199,
      "c1ccc2nnc": 2200,
      "NCc1cnn": 2201,
      "c3oc": 2202,
      "cc1CC": 2203,
      "COCCCN": 2204,
      "OC3CCCC3": 2205,
      "c2ccccc2o1": 2206,
      "1Cc1cc": 2207,
      "CCOc1ncccc1C": 2208,
      "CSc2ccccc2": 2209,
      "OCCS": 2210,
      "CCCCl": 2211,
      "CCCCc1nnc": 2212,
      "Nc1ccccc12": 2213,
      "ncc2C1": 2214,
